{
  "Cataclysmic Signet Brand": {
    "Blood Death Knight": {
      "tier": "S",
      "note": "The new \"Keep yourself in combat\" trinket; this also does a small amount of backdraft damage to yourself every time it procs - but it is absolutely worth it considering how ludicrously strong it is. Unlike previous trinkets such as  Elementium Pocket Anvil and  Old Warrior's Soul, the stack decay behavior when out of combat is significantly slower. You can, just like you could with  Elementium Pocket Anvil, use  Worn Doll and then hit  Blood Boil to artificially put yourself in combat every 20 minutes."
    },
    "Frost Death Knight": {
      "tier": "S",
      "note": "Our strongest passive trinket during progression. It takes 2-3 minutes to fully ramp so should not be picked for Mythic+ or short raid fights. Be aware of the self-damage, but it caps around 12k/tick and the damage output is worth it."
    },
    "Unholy Death Knight": {
      "tier": "S",
      "note": "Our best passive trinket to choose. This gives some Strength but primarily just a lot of raw trinket damage. Be careful with it though since it does deal a significant amount of damage to yourself. This is generally fine since we are naturally really tanky but you should be careful using the trinket during progression!"
    },
    "Havoc Demon Hunter": {
      "tier": "S",
      "note": "Heavy damage single target proc that ramps stacks up on you with consistent combat, deals self-damage over 5 stacks. Incredibly strong single-target raid trinket and highest priority to get for single target."
    },
    "Vengeance Demon Hunter": {
      "tier": "S*",
      "note": "Static Agility. 3+Haste RPPM proc that deals a large Fire DoT to your target, and stacks a buff that increases the damage by 2.66% per stack up to 15 stacks(40% total). Above 5 stacks, it deals half the damage to yourself as well, and at 15 stacks it will splash an additional 10% split amongst nearby targets. It decays by 1 stack for every 5 seconds out of combat, and drops entirely after 15 seconds. Somewhat similar to the  Elementium Pocket Anvil from last season, but stacks more quickly due to being a proc and hasted, rather than on-use cooldown. Incredibly good damage, especially for Raid, but can be tricky to maintain the stacks in dungeons. Despite this, still our strongest DPS trinket. Note: Requires Havoc loot spec"
    },
    "Feral Druid": {
      "tier": "S",
      "note": "Pretty simple trinket that just procs damage on attack. Does do some damage to yourself but hey it's tuned high."
    },
    "Guardian Druid": {
      "tier": "S",
      "note": "Deals great passive damage but also damages you slightly."
    },
    "Survival Hunter": {
      "tier": "S+",
      "note": "This trinket deals an insane amount of single target damage damage once it is ramped up, and even keeps up with AoE trinkets once it is. Although the stacks drop off fast, making it less practical in m+. The self-damage can be dicey, but you have a lot of passive sustain through Leech. One thing to consider is that the self damage can eat into your  Iced Phial of Corrupting Rage  uptime."
    },
    "Brewmaster Monk": {
      "tier": "A+",
      "note": "Deals damage over time as a random proc. The damage ramps up with each proc, eventually dealing 50% of its damage to you, and 10% of its damage to nearby enemies. The buff rapidly decays while out of combat, so maintaining it throughout Mythic+ can be challenging, or even impossible depending on the dungeon. This is a raid-focused trinket that is a bit dangerous for tanks to use. It also comes with the downside of ramping its damage over time, and it takes several minutes to hit full strength, so as boss kills get quicker and quicker, this trinket will become weaker. It can deal a lot of damage if you're willing to risk the downside, but its value will decrease throughout farm as re-kill times get shorter."
    },
    "Protection Paladin": {
      "tier": "S",
      "note": "This is a ramping damage trinket that does more damage, the longer you are in combat. It applies a damage over time effect to your target and gives you a buff that increases the damage of the damage over time effect. This is primarily a single target trinket but once you reach 15 stacks, it can do some cleave damage. It currently takes 2.5-3 minutes to reach max stacks. If a raid encounter is long enough or if you can maintain stacks in a dungeon, this will do significant amounts of damage. It will be better on progression kills and not farm. As kill time times get shorter, this trinket will perform worse. Overall, this a particularly good trinket and highly recommended to use in every situation and content type.NOTE: You can use  Worn Doll to stay in combat to artificially extend the buff so it won't drop between in pulls in a M+ dungeon. If you hit it with any type of AE attack, it puts you into combat so you can retain the buff."
    },
    "Retribution Paladin": {
      "tier": "S (ST)",
      "note": "Passive damage proc that stacks up over time. Powerful for raids, but not great for Mythic+."
    },
    "Assassination Rogue": {
      "tier": "S",
      "note": "On longer Single Target fights past 5 to 6 minutes, there is simply no better option. You do have to have quite good gear for it to be better than  Accelerating Sandglass, but this is your true BiS. The self-damage portion is fairly minor all things considered. In Mythic+ the stacks reset too often to be used effectively"
    },
    "Outlaw Rogue": {
      "tier": "A+",
      "note": "Very strong throughput trinket and the downside is very negligible. The bigger issue it has is that it requires long fight times to get value from"
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Strong trinket which does not work as well with multiple targets and has a curse effect to it. It is a strong option but there are other options with similar strength."
    },
    "Enhancement Shaman": {
      "tier": "S*",
      "note": "This deals an extreme amount of single target damage, but it can take upward of 3 minutes to fully ramp. Once it gets going, it really starts dealing damage, but the downsides of needing to stay in combat and the relevant damage taken makes it more of a raid pick. Despite getting nerfed twice, it's still recommended, it's just that good."
    },
    "Protection Warrior": {
      "tier": "S",
      "note": "Deals damage over time as a random proc. The damage ramps up with each proc, eventually dealing 50% of its damage to you, and 10% of its damage to nearby enemies. The buff rapidly decays while out of combat, so maintaining it throughout Mythic+ can be challenging, or even impossible. This is a raid-focused trinket that is a bit dangerous for tanks to use. It also comes with the frustrating downside of ramping its damage over time, so as boss kills get quicker and quicker, this trinket will become weaker. It can deal a lot of damage if you're willing to risk the downside, but its value will decrease throughout farm as re-kill times get shorter."
    }
  },
  "Branch of the Tormented Ancient": {
    "Blood Death Knight": {
      "tier": "S",
      "note": "A very simple trinket - every 2min30s, you can apply four stacks of a buff to yourself. Each subsequent  Death Strike,  Heart Strike,  Marrowrend or any other physical effect knocks off a stack and deals a meaty amount of shadowflame damage to your target and everything within 8 yards of it, split between all targets and gaining 15% bonus damage per target hit, up to 6."
    },
    "Frost Death Knight": {
      "tier": "A+",
      "note": "On-use raw damage trinket that does a high amount of raw damage."
    },
    "Unholy Death Knight": {
      "tier": "A",
      "note": "On-use raw damage trinket that does very well in AoE scenarios, while being quite competitive in Single Target."
    },
    "Protection Paladin": {
      "tier": "A+",
      "note": "This is an on-use trinket for burst. It has primary stat which we like and a very solid on-use effect. WIth short cooldown abilities, we can proc all 4 root effects very quickly. I recommend using this in Single Target raid situations, especially for fights with burn phases and damage amps namely: Smolderon and Tindral Sageswift"
    },
    "Retribution Paladin": {
      "tier": "A (ST)",
      "note": "On use damage trinket that will deal AoE damage over a short period. The slow effect is insignificant and is quickly removed."
    },
    "Protection Warrior": {
      "tier": "A",
      "note": "On-use trinket that makes your next 4 melee attacks splash extra damage split among nearby enemies. The 150-second cooldown is pretty long. It also slows you by 15% per stack of the buff, so it’s a bit annoying, although the slow doesn't last too long. It deals a lot of damage, so that's good."
    }
  },
  "Rezan's Gleaming Eye": {
    "Blood Death Knight": {
      "tier": "S",
      "note": "This trinket was reworked this season; for all intents and purposes, its new effect is  Rezan's Fury, an old azerite power.Its upfront and DoT damage is buffed by  Bloodshot, making it 25% better for us than other specs."
    },
    "Frost Death Knight": {
      "tier": "A-",
      "note": "Nice passive trinket that provides a significant amount of raw damage over a fight. However, in AoE it tends to fall behind other options."
    },
    "Unholy Death Knight": {
      "tier": "A+",
      "note": "Really good raw damage trinket that pairs well with an active on-use stat trinket!"
    },
    "Protection Paladin": {
      "tier": "A+",
      "note": "This trinket does passive damage on a proc. It's RNG but it procs quite often and will do a solid amount of damage. This is a good trinket for single target raid encounters or situations with priority damage."
    },
    "Retribution Paladin": {
      "tier": "A (ST)",
      "note": "Passive damage proc trinket that summons a dinosaur to attack your target."
    },
    "Protection Warrior": {
      "tier": "A",
      "note": "A once-great Mythic+ trinket that has been redesigned into a basic damage proc. It's a little boring, but the single-target damage value is very good!"
    }
  },
  "Augury of the Primal Flame": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "It does damage. It has no primary budget but it does enough damage to mostly compensate, particularly when you take its increased item level into account. Since its value depends a lot more on your critical strike chance than other trinkets, we strongly recommend that you evaluate this by simming to find out if it is worth for you."
    },
    "Frost Death Knight": {
      "tier": "C",
      "note": "Generally undertuned trinket"
    },
    "Unholy Death Knight": {
      "tier": "C",
      "note": "Solid trinket with a spec that relies a lot on Crit, which we don't. Not a good trinket."
    },
    "Havoc Demon Hunter": {
      "tier": "A",
      "note": "Good passive trinket, dealing bonus damage off of your critical strikes. This trinket deals great damage in Single Target scenarios but quickly falls off in value in cleave/AoE."
    },
    "Vengeance Demon Hunter": {
      "tier": "A+",
      "note": "Static Crit. 1+Haste RPPM proc that causes your crits in the next 20 seconds to deal 50% additional damage as Fire split between nearby enemies. It has a cap, but it's increased by crits. Deals quite a lot of damage, especially since we stack Crit. Also has bonus item level due to being Very Rare, making it a bit better. Note: Requires Havoc loot spec"
    },
    "Balance Druid": {
      "tier": "D",
      "note": "Very rare trinket with a high item level, but is of very little use for Balance due to its Critical Strike based nature."
    },
    "Feral Druid": {
      "tier": "?????",
      "note": "I'm pretty convinced this trinket is supposed to be BIS for everyone. Currently though it doesn't look like it is. Maybe it will get buffed."
    },
    "Guardian Druid": {
      "tier": "S",
      "note": "Great passive trinket that deals good damage."
    },
    "Devastation Evoker": {
      "tier": "B+",
      "note": "Passive trinket. Damage procs during crits."
    },
    "Augmentation Evoker": {
      "tier": "D",
      "note": "Passive Critical Strike is definitely not ideal, and the damaging effect scales off of your direct damaging spells, which is not a strong suit for Augmentation."
    },
    "Beast Mastery Hunter": {
      "tier": "D",
      "note": "The damage proc from this does not work with pets, so this is a lot worse for us compared to most classes."
    },
    "Marksmanship Hunter": {
      "tier": "A+",
      "note": "Strong Single-Target Trinket, with some mild AoE scaling."
    },
    "Survival Hunter": {
      "tier": "A",
      "note": "With how much critical strike we have you'll get a lot of mileage from this proc, sadly despite the \"very rare\" status and raised item level the trinket doesn't appear to perform well enough to break into S-tier."
    },
    "Arcane Mage": {
      "tier": "B-",
      "note": "This trinket is really meh for last boss loot."
    },
    "Fire Mage": {
      "tier": "S+",
      "note": "Passive trinket. Damage procs during crits."
    },
    "Frost Mage": {
      "tier": "A",
      "note": ""
    },
    "Brewmaster Monk": {
      "tier": "A+",
      "note": "Passive damage proc trinket. Effortless to use, deals a good amount of damage, but not quite as much as some alternatives."
    },
    "Protection Paladin": {
      "tier": "S",
      "note": "This trinket has critical strike rating which we like and creates a feedback loop since the trinket procs on critical strikes. It's random but its output is very consistent. It's one of the best trinkets available and should be used in every situation."
    },
    "Retribution Paladin": {
      "tier": "A (ST)",
      "note": "Passive damage proc. This trinket has very high variance - the damage it does can be strong, but it's pretty inconsistent."
    },
    "Shadow Priest": {
      "tier": "B",
      "note": "This very rare trinket from Fyrakk is exceptionally potent in dungeon AoE but leaves something to be desired on Single Target compared to other options."
    },
    "Assassination Rogue": {
      "tier": "B",
      "note": "Don't let the \"very rare\" tag fool you, this trinket is quite weak and the proc is very random. It can be okay to use in a dungeon setting, but should generally be avoided or replaced with better trinkets."
    },
    "Outlaw Rogue": {
      "tier": "A",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "B",
      "note": "Only strong in sustained cleave fights."
    },
    "Elemental Shaman": {
      "tier": "C",
      "note": "While this trinket reads good, given our guaranteed critical strikes, all classes can cap this trinket out easily enough and considering that this trinket drops from the last boss, the numbers on it are just not high enough to see consideration."
    },
    "Enhancement Shaman": {
      "tier": "A+",
      "note": "This has the potential to do extremely good damage, but since we don't stack crit we sometimes struggle to fulfill the entire proc. Due to its low RPPM even though it's Hasted, it can have big swings in value so is slightly behind alternatives - but still a great option despite not coming with Agility."
    },
    "Affliction Warlock": {
      "tier": "C",
      "note": "Very rare trinket with a high item level, but is of very little use for Affliction due to its Critical Strike based nature."
    },
    "Demonology Warlock": {
      "tier": "D",
      "note": "A very rare trinket with a high item level; given the nature of the proc for this trinket it is not going to shine through on single target, but may have some uses in Mythic+. Given it's niche use case, this trinket is not too desirable."
    },
    "Destruction Warlock": {
      "tier": "D",
      "note": "A very rare trinket with a high item level; given the nature of the proc for this trinket it is not going to shine through on single target, but may have some uses in Mythic+. Given it's niche use case, this trinket is not too desirable."
    },
    "Protection Warrior": {
      "tier": "S",
      "note": "Very strong damage proc trinket. Effortless to use, deals a lot of damage. No downsides. It’s free real estate."
    }
  },
  "Fyrakk's Tainted Rageheart": {
    "Blood Death Knight": {
      "tier": "A (mythic-only)",
      "note": "What a fall from grace on this trinket. It started out as a really solid tank trinket on PTR, then got turned into a real DPS trinket and now... it's neither. Instead, it gets its A rating thanks to being 10 item levels above the competition.The pulse effect is simple, it's capped at 8 targets within 6 yards of you, it does a small amount of damage periodically. Nothing to really think about there.The shield + self-damage effect + damage pulse gives you a shield, a DoT, and pulses damage around you, split between all enemies but gaining 15% per target hit up to a maximum of 75% more. It deals mediocre damage on an equal footing with other trinkets, and the shield itself is weaker than a lot of other options if you wanted a shield (Which you don't), while the cooldown is also awkward. But - it deals some damage, just not enough to really be classed as anything more than \"Failed at everything but gets carried hard by one number\" category."
    },
    "Vengeance Demon Hunter": {
      "tier": "A+ (AoE)/B (ST)",
      "note": "Versatility static. Primarily damage-focused despite being a tank trinket. Deals consistent uncapped damage that linearly scales with number of targets pulsing every 3 seconds while in combat. 1.5 min CD on-use provides a massive shield for 20 seconds, but causes you to take 15% of that damage and deal 16% of it to nearby enemies every 2 seconds for 10 seconds, thus making the shield only about 25% as strong as it says on the tooltip. However, it does give a burst shield which can be useful for effectively spreading out the damage into a DoT sometimes. Unfortunately, it's Versatility instead of Agility, making it a little worse than it would be otherwise. Note: Requires Vengeance loot spec"
    },
    "Guardian Druid": {
      "tier": "S",
      "note": "Good on-use absorbs shield that also deals high damage, also deals damage to yourself so that is something to be aware of as the damage is not neglibile."
    },
    "Brewmaster Monk": {
      "tier": "S",
      "note": "The best tank trinket Blizzard has made in some time. It shields you and causes you to radiate a large chunk of damage to nearby enemies. The shield is pretty good, the 90-second cooldown is relatively brief, and the damage is respectable for a trinket that also has tangible defensive benefits. It’s very good."
    },
    "Protection Paladin": {
      "tier": "A",
      "note": "This trinket does passive damage every 3 seconds, provides an on-use shield, and does split damage to nearby enemies. The trinket also has vers instead of Strength, which is less than ideal. Passive damage is nice for a consistent damage source and passive threat. The on-use could have some value as a burst damage tool as the self-damage mechanic will partially off-set the absorb. This is a good trinket for M+."
    },
    "Assassination Rogue": {
      "tier": "C",
      "note": "This trinket isn't on our drop-table as rogues but other DPS specs are considering its usage. For Assassination, this trinket is really bad and gives Versatility as a base stat, which is undesirable. Do not use"
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Technically a tank trinket but does a lot of damage."
    },
    "Enhancement Shaman": {
      "tier": "B+",
      "note": "While this is a tank trinket we can still use it and get solid damage out of the effect. The extra shield may even give us reason to consider it for Mythic+ sitatuitions, but dropping Agility and the awkward cooldown makes it fine, but nothing special. The backlash damage after is also fairly dangerous, so requires planning if you really want to invest in it."
    },
    "Protection Warrior": {
      "tier": "S",
      "note": "The best tank trinket Blizzard has made in some time. It shields you and causes you to radiate a large chunk of damage to nearby enemies. The shield is pretty good, the 90-second cooldown is relatively brief, and the damage is respectable for a trinket that also has tangible defensive benefits. It’s good."
    }
  },
  "Pip's Emerald Friendship Badge": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "An unusual - and frankly pretty cool take on the concept of a stat stick. Every 12 seconds, every single action you take has a chance to \"burst\" this trinket's effect to a new secondary stat, at which point it will decay over 12 seconds to a minimum value. It typically almost always cycles instantly after 12 seconds, making it a somewhat random but slightly overbudgeted stat stick. It is better in AoE than on single target, but it is by no means bad in either."
    },
    "Frost Death Knight": {
      "tier": "S",
      "note": "Best passive trinket for all content. Frost Death Knight scales strongly with secondary stats and this trinket provides more consistent secondaries than any other option"
    },
    "Unholy Death Knight": {
      "tier": "A+",
      "note": "This is your passive alternative to  Cataclysmic Signet Brand, providing a large amount of raw stats over an encounter. This can mess up your  Mirror of Fractured Tomorrows so be careful when using it and make sure to keep track of the various raw stat amounts it can put you at! Good Mythic+ choice due to the raw secondary stats."
    },
    "Havoc Demon Hunter": {
      "tier": "A+",
      "note": "Stat stick trinket that's fine in single target scenarios and relatively powerful in M+ and cleave. Always a fine trinket to run."
    },
    "Vengeance Demon Hunter": {
      "tier": "A",
      "note": "Agility static, with a small rotating secondary buff of either Crit, Mastery, or Versatility. 2 RPPM proc that can cause it to switch the buff as well as empower it by 12 times for 12 seconds, diminishing the multiplier by 1 per second. It's quite a lot of consistent secondary stat, but slightly diminished by the Mastery being active about 1/3 of the time."
    },
    "Balance Druid": {
      "tier": "S",
      "note": "A passive trinket that provides baseline intellect and secondary stats."
    },
    "Feral Druid": {
      "tier": "A",
      "note": "Everyone should be somewhat used to this Trinket archetype now, we've had one every tier. You get stats, your friend gets stats. Sometimes you get more stats."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Great passive stat trinket that also procs even more secondary stats. As all of our stats are quite even in power this is quite decent."
    },
    "Restoration Druid": {
      "tier": "A",
      "note": "Note that Pips isn't a team-based trinket like Ominous Chromatic Essence was. All three best friends are yours, and the trinket will rotate through them. Expect to get a couple hundred crit, vers, and mastery from it over a fight. Twice a minute your active best friend will change, giving you a huge stat buff that'll decay back down to ~200. Unfortunately, the trinket can't offer haste which hurts its rating for us a little bit."
    },
    "Devastation Evoker": {
      "tier": "A+",
      "note": "Passive. Random secondary stats that diminish over time."
    },
    "Preservation Evoker": {
      "tier": "A",
      "note": "Pip's is a rotating stat trinket that'll give you a bit of crit, versatility and mastery (and no haste). You'll get a passive ~200 or so of one of the secondaries at all times and then a couple of times a minute a new best friend joins you, giving you a huge decaying stat buff until it's back at its passive value. Incredibly reliable and your best raid option right now."
    },
    "Augmentation Evoker": {
      "tier": "B",
      "note": "Passive Intellect is always valuable. The Versatility proc heavily devalues this trinket for Augmentation, otherwise this is a reasonable stat stick option."
    },
    "Beast Mastery Hunter": {
      "tier": "S",
      "note": "A relatively simple yet powerful statstick which works in all situations."
    },
    "Marksmanship Hunter": {
      "tier": "S",
      "note": "Strongest Stat Stick Trinket"
    },
    "Survival Hunter": {
      "tier": "B",
      "note": "The random nature of this trinket brings it down in the rankings as Mastery is our weakest stat, but it sure does give a lot of stats—especially when a new bestie tags in. Performs better in AoE than single-target because raw stats scale well into AoE. It is effectively A tier for AoE purposes."
    },
    "Arcane Mage": {
      "tier": "A",
      "note": "Our second best passive option."
    },
    "Fire Mage": {
      "tier": "A",
      "note": "Passive trinket, get random buffs."
    },
    "Frost Mage": {
      "tier": "A",
      "note": "As all secondary stats are typically quite good for Frost Mages, this is a great passive trinket."
    },
    "Brewmaster Monk": {
      "tier": "A-",
      "note": "A cute name and trinket idea. Everyone needs a best friend!Practically speaking, this is just a stat proc trinket that alternates between Crit, Versatility, and Mastery. It’s not amazing, but it’s not bad, either. It is slightly overbudget, which is great! It's decent!"
    },
    "Mistweaver Monk": {
      "tier": "A",
      "note": "While this trinket doesn't give us any of the stat we'd want most (Haste), it's able to perform well enough cycling between the other secondary stats."
    },
    "Holy Paladin": {
      "tier": "A",
      "note": "You do not pick which buff you want with this trinket, rather it randomly cycles through each buff and you can even get the same one in a row. You will always have one of the buffs active."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is a very solid stat stick trinket. You can get one of 3 buffs: Mastery, Critical Strike or Vers, all of which can randomly proc to a large buff that diminishes per second for 12 seconds. The order you get the buffs is random so you can't game it and when the trinket swaps stats, you get the large buff effect that diminishes. This is a trinket to use in situations where you're looking for something good that doesn't require a ton of brain power."
    },
    "Retribution Paladin": {
      "tier": "A (AoE)",
      "note": "Passive secondary stat buff. Will occasionally empower itself and swap to a new stat."
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "Very powerful stat stick with near-constant uptime."
    },
    "Holy Priest": {
      "tier": "S",
      "note": "Very powerful stat stick with near constant uptime."
    },
    "Shadow Priest": {
      "tier": "A",
      "note": "This is Shadow's strongest passive trinket from the raid and a solid option alongside any of the strong on use trinkets."
    },
    "Assassination Rogue": {
      "tier": "S",
      "note": "Just a great all-around trinket that can easily slot into any situation. Incredibly strong in mythic+ as well"
    },
    "Outlaw Rogue": {
      "tier": "D",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "S",
      "note": "The best passive trinket from the Raid. Subtlety can utialize all 3 proc effects well what makes this a solid option."
    },
    "Elemental Shaman": {
      "tier": "S-",
      "note": "A nice little stat stick. While the mastery proc can end up leading us to overcap, and the crit does not work with Lava Burst, this still ends up being one of the better trinkets."
    },
    "Enhancement Shaman": {
      "tier": "S",
      "note": "This is the passive stat trinket to chase this tier, with the unique bonus being an occasional flare up of each stat into a stronger version before cycling. While it lacks Haste in that cycle, the high proc rate paired with the consistent backup stats makes this a great all-rounder and works in all types of content."
    },
    "Affliction Warlock": {
      "tier": "B",
      "note": "A passive trinket that provides baseline intellect and secondary stats."
    },
    "Demonology Warlock": {
      "tier": "A-",
      "note": "Given the passive nature of this trinket, it can still be a good option for Demonology, though a small step below the others. You have a 2/3 chance to get a stat proc that is very good for Demonology, but do run the risk of hitting Versatility which is our least desired stat."
    },
    "Destruction Warlock": {
      "tier": "A-",
      "note": "Being able to get passive stats via. a trinket proc is very strong for Destruction. This trinket is a brilliant choice for Destruction."
    },
    "Protection Warrior": {
      "tier": "B+",
      "note": "A cute name and trinket idea. Everyone needs a best friend!Practically speaking, this is just a stat proc trinket that alternates between Crit, Versatility, and Mastery, and it is overbudget for its item level. The lack of Haste is not ideal. It’s not amazing, but it’s not bad, either. Above average! Decent!"
    }
  },
  "Accelerating Sandglass": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "20 times per minute on all abilities and auto-attack damage events, you gain a stack of  Accelerating Sandglass, granting you a decent amount of haste, up to a maximum of 8 stacks. The application of this stack has a chance based on your total number of stacks to convert each stack into a stack of  Accelerating Sandglass. These get consumed on every ability hit to deal bonus damage to your target. When you run out of these stacks, you begin gaining  Accelerating Sandglass again.Now that you can acquire it at maximum item level, and with the removal of the ultra juicy trinket pool of Season 2, this trinket suddenly looks a lot more appealing, but mostly for AoE/Mythic+."
    },
    "Frost Death Knight": {
      "tier": "S",
      "note": "Solid passive trinket that provides consistent haste. BiS for  Obliteration builds and a strong option for  Breath of Sindragosa."
    },
    "Unholy Death Knight": {
      "tier": "A+",
      "note": "Solid passive trinket with some variability in its usefulness due to the ramping nature of the Haste proc. Has an interesting added benefit of potentially moving your  Mirror of Fractured Tomorrows to Haste during your secondary 3-minute burst windows. If you don't have  Bloodlust active here, Haste becomes the better proc for Mirror! To achieve this, try and keep your Mastery between 1 and 2 Sandglass Haste stacks above your Haste, to allow the trinket to bring you to Haste as your highest stat! Between 125 and 250 raw stat difference or so."
    },
    "Havoc Demon Hunter": {
      "tier": "B",
      "note": "Haste proc with relatively low value that turns into a damage proc, not tuned as well as other trinkets for Havoc."
    },
    "Vengeance Demon Hunter": {
      "tier": "A-",
      "note": "20 RPPM proc granting haste per proc, then dealing damage based on number of stacks before the timer runs out. One of the better M+ trinkets this season."
    },
    "Feral Druid": {
      "tier": "S",
      "note": "A Passive cycling haste trinket. Just tuned pretty well."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Stacking haste trinket with a damage effect proc at the end of each cycle. Fantastic trinket for us."
    },
    "Beast Mastery Hunter": {
      "tier": "B",
      "note": "This performs well in sims but these fail to account for current bugs. Also requires you to be in melee for full value, which isn't always practical. Note: Requires Survival Loot Spec to acquire."
    },
    "Marksmanship Hunter": {
      "tier": "B",
      "note": "Performs worse than it sims, and requires you to be in Melee for the full effect."
    },
    "Survival Hunter": {
      "tier": "S",
      "note": "A solid amount of Haste entirely on a passive effect with a nice, small burst of damage at the end. Very good for a fire and forget trinket with minimal worries. can break into S-tier for m+ and AoE."
    },
    "Brewmaster Monk": {
      "tier": "B+",
      "note": "A stacking Haste proc attached to a damage proc. It's a simple trinket design that lacks value in AoE. In terms of single-target damage, it's decent."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is a random proc trinket that sims very well. You will consistently gain the Haste buff, but you won't consistently get to 8 stacks. Once the buff expires, the damage portion triggers, and you start over at 0 stacks of Haste. Testing shows that the buff will trigger between 6 to 8 stacks every time. The damage proc will be low on your overall and that's ok. Don't worry about that part. This trinket should be considered as a good and consistent stat stick and that's where most of the value is. Because of that, this is a consistent trinket you can use in any situation."
    },
    "Retribution Paladin": {
      "tier": "B",
      "note": "Passive Haste buff and damage proc."
    },
    "Assassination Rogue": {
      "tier": "S",
      "note": "A strong passive option in mythic+ to replace the  Cataclysmic Signet Brand which loses a lot of value from frequent combat drops. In Mythic+ it is slightly worse than the  Pip's Emerald Friendship Badge above, but can be better in single target. It's accessible from a dungeon we already farm for  Nick of Time, it's able to be used universally, and its equip-and-forget passive effect on top. Just a great trinket"
    },
    "Outlaw Rogue": {
      "tier": "A",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Haste is our weakest stat but the trinket gives enough haste to still be a strong option."
    },
    "Enhancement Shaman": {
      "tier": "A",
      "note": "The ramping Haste is solid and works with both builds, with a leaning toward Storm. The Physical hit also keeps it relevant in single target compared to higher stat options."
    },
    "Protection Warrior": {
      "tier": "A",
      "note": "A stacking Haste proc attached to a damage proc. It's a simple trinket design. The stat budget is good in AoE, and the proc is good for single-target damage. It's a pretty good trinket."
    }
  },
  "Coiled Serpent Idol": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "This trinket just spawns Hydras that blast mobs with fire - frequently - and they live for 10 seconds. They appear to have a 40yd maximum range, so if you spawn a hydra just before you have to move a significant distance, you'll lose some value. The AoE component of this trinket is also jank as it requires the hydra's target to die for the AoE to trigger - something that would be significantly better if it was just any target."
    },
    "Frost Death Knight": {
      "tier": "A-",
      "note": "A well-tuned damage trinket. Strong enough to compete with the options that give stats but it not something Frost particularly wants."
    },
    "Unholy Death Knight": {
      "tier": "B",
      "note": "Passive raw-damage trinket that doesn't do quite enough damage to be useful."
    },
    "Havoc Demon Hunter": {
      "tier": "A",
      "note": "Powerful proc trinket for single target."
    },
    "Vengeance Demon Hunter": {
      "tier": "A+",
      "note": "Static Agility. 1.5+Haste RPPM proc that can summon a pet to attack your target when you crit. On every 3rd summon, it summons 3 pets instead, and if your target dies, it will deal a burst of AoE damage to up to 8 enemies nearby. This is quite strong, especially in Single Target, and it is entirely passive. Note: Requires Havoc loot spec"
    },
    "Feral Druid": {
      "tier": "A",
      "note": "You equip it it does damage."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Passive damage proc trinket."
    },
    "Beast Mastery Hunter": {
      "tier": "B",
      "note": "A decent, simple damage proc trinket which works in most scenarios."
    },
    "Marksmanship Hunter": {
      "tier": "A+",
      "note": "Strongest Pure Single-Target Trinket"
    },
    "Survival Hunter": {
      "tier": "A",
      "note": "We'll regularly trigger this trinket and it's free damage. What's not to love?"
    },
    "Brewmaster Monk": {
      "tier": "A",
      "note": "A simple damage proc trinket. The damage output is pretty good, it deals bonus AoE damage if its target dies, and on every third proc, it deals triple damage. Not bad."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is a proc trinket that has a chance to spawn a Hydra when you critical strike. Every 3rd spawn will spawn 3 hydras instead. The Hydras will pelt your target with fire damage over a 10s period. The proc can happen outside of your burst window and the trinket can show a lot of variance especially in short encounters."
    },
    "Retribution Paladin": {
      "tier": "B",
      "note": "Passive trinket that will occasionally summon a snake to attack your target."
    },
    "Assassination Rogue": {
      "tier": "A",
      "note": "Just a solid passive trinket that does some damage"
    },
    "Outlaw Rogue": {
      "tier": "S",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Gives a high amount of one stat and is very strong in raiding and Mythic+."
    },
    "Enhancement Shaman": {
      "tier": "A",
      "note": "Deals solid single target damage and has some AoE redundancy with the AoE trigger, and even ramps each third proc. It still comes with some of the problems of stationary AI which can cause procs to fizzle though, meaning other options are more universal."
    },
    "Protection Warrior": {
      "tier": "A",
      "note": "A simple damage proc trinket. The damage output is pretty good, it deals bonus AoE damage if its target dies, and on every third proc, it deals triple damage. Not bad."
    }
  },
  "Gift of Ursine Vengeance": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "This is the most interesting trinket from a functional point of view. It unfortunately is also the most polarized in terms of value, and a lot of the nuance is not described in the tooltip.Every time you or a friendly target close to you is victim of a direct damage event (no DoTs), including parries/dodges, with a maximum of a stack every 3 seconds, you gain a stack of  Rising Rage and counterattack the nearest enemy within 8 yards for a decent amount of physical damage. These last for 60 seconds, and grant you a decent amount of strength. If there are no enemy targets within 8 yards, you do not gain the stack nor perform the counterattack.When you reach 30 stacks (i.e. every 90s minimum), these turn into  Fury of Urctos - while this is up, you heal for a relatively negligible amount every second, and deal physical damage (hello  Bloodshot) as a counterattack on your nearest target whenever you take any direct damage event, with a 0.1s internal cooldown.Yes, this is as bonkers as it sounds in Mythic+. It is not entirely bad in ST, but really encounter-dependent. All it takes for it to be terrible is a fight with primarily rot (periodic/non-direct) damage."
    },
    "Vengeance Demon Hunter": {
      "tier": "S- (AoE)/A- (ST)",
      "note": "Static Agility. Proc every 3 seconds upon anybody in your group including yourself taking damage that deals a burst of damage to the nearest enemy and grants a small amount of Agility, stacking up to 30 times. After 30 stacks (every 90 seconds), gain a buff for 8 seconds that deals the damage proc every time you are attacked with a 100ms ICD, even if you avoid the attack. This damage is all funneled into the nearest target, so it's exceptionally good for priority damage in AoE. It also has a small heal, but it's almost negligible. Note: Requires Vengeance loot spec"
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Can be exceptionally strong, however situational. Better in raids than M+ due to the way it stacks up."
    },
    "Brewmaster Monk": {
      "tier": "A",
      "note": "Grants a reactive damage proc that triggers every time you or an ally are hit. This sounds good, and it could be amazing if not for the 3-second internal cooldown. Triggering the effect precisely on the internal cooldown is a little unrealistic, which hurts the value of this trinket. A big problem with this trinket is that it only triggers if you are within 8 yards of an enemy when the proc occurs. If you aren't in range of an enemy to deal the reactive hit, you cannot gain stacks.Each reactive hit grants a very small, stacking Agility buff. Upon hitting 30 stacks, so after a minimum of 90 seconds, you heal for a modest amount of damage (about half a health potion) and deal reactive damage to all hits over 8 seconds."
    },
    "Protection Paladin": {
      "tier": "A",
      "note": "This trinket has strength primary stat and a strength primary stat proc, both of which are very nice and something you might want to use it for. However, the counter-attack damage is incredibly low and won't really be that valuable, given it has a 3s ICD. The ICD will cap that specific aspect of the trinket in multi-target tanking situations like dungeons.But the strength stat aspect makes the trinket worth using as strength gives damage, armor, and parry, making it a good offensive and defensive trinket for us, especially for dungeons."
    },
    "Protection Warrior": {
      "tier": "A",
      "note": "Grants a reactive damage proc that triggers every time you or an ally are hit. This sounds good, and it could be amazing if not for the 3-second internal cooldown. Triggering the effect precisely on the internal cooldown is a little unrealistic, which hurts the value of this trinket. A big problem with this trinket is that it only triggers if you are within 8 yards of an enemy when the proc occurs. If you aren't in range of an enemy to deal the reactive hit, you cannot gain stacks.Each reactive hit grants a very small, stacking Strength buff. Upon hitting 30 stacks, so after a minimum of 90 seconds, you heal for a modest amount of damage (about half a health potion) and deal reactive damage to all hits over 8 seconds. The idea is good, but the 3-second internal cooldown seriously limits this trinket’s value."
    }
  },
  "Ember of Nullification": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "This trinket was also reworked for this season and now features a full versatility secondary budget; previously, the 2 second silence effect was the only bonus effect this trinket had.This makes this trinket a boring but extremely capable stat stick, with a bonus silence effect when you get hit by a spell. This has a 20 second ICD and a 40% proc chance, making it not quite guaranteed, but nice enough to gain some value in keys."
    },
    "Havoc Demon Hunter": {
      "tier": "A",
      "note": "A good passive mythic+ trinket option, giving flat versatility and agility at all times. Second best behind Pip's for a stat stick. MUST BE VENGEANCE/TANK LOOT SPEC TO LOOT."
    },
    "Vengeance Demon Hunter": {
      "tier": "B",
      "note": "Static Agility and Versatility. Has a special effect in that it can automatically silence enemies that deal magic damage to you once every 20 seconds. This effect is extremely niche and not particularly useful this season. Note: Requires Vengeance loot spec"
    },
    "Guardian Druid": {
      "tier": "B",
      "note": "Stat stick at a reduced weighting for an additional perk of silencing mobs often which can be handy for grouping in m+."
    },
    "Beast Mastery Hunter": {
      "tier": "A",
      "note": "Essentially a Versatility Stat Stick which is a decent thing to have."
    },
    "Marksmanship Hunter": {
      "tier": "A",
      "note": "Strong Stat-Stick Trinket."
    },
    "Survival Hunter": {
      "tier": "A",
      "note": "This is a fairly powerful trinket. The versatility provides a nice defensive benefit and raw stats scale extremely well into AoE. With that in mind this trinket is easily S-tier for M+, but falls slightly short anywhere else."
    },
    "Brewmaster Monk": {
      "tier": "B",
      "note": "This trinket is very boring. It grants Agility and Versatility, and can very occasionally silence enemy casters. Is it good? Actually, yeah. It gives a ton of perfectly-itemized stat budget, which is great. The random silences are just an occasional bonus.Boring, but not bad."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is really a Vers. stat stick with a proc. The ideal situation to use this in is dungeons since you will take some magic damage and the extra silence could be helpful. But Versatility is not a great stat for us, the silence could go on a creature that doesn't matter, and Protection is an interrupt machine as it is. This is just an average stat stick."
    },
    "Outlaw Rogue": {
      "tier": "B",
      "note": "This trinket over an entire dungeon is weaker than the ones above, generally scales better with larger target counts than the ones above."
    },
    "Enhancement Shaman": {
      "tier": "A",
      "note": "For us this is predominantly a full budget Vers stat stick, which considering we just really like stats works out fine. The proc might have some fun uses but nothing we're really interested in for now, the hard part is getting hold of one since it only drops for tank specializations."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "This trinket is very boring. It grants Strength and Versatility, and can very occasionally silence enemy casters. Is it good? Actually, yeah. It gives a ton of perfectly-itemized stat budget, which is great. The random silences are just an occasional bonus.Boring, but not bad."
    }
  },
  "Spores of Alacrity": {
    "Blood Death Knight": {
      "tier": "A",
      "note": "A somewhat overbudgeted haste stick. Macro it into your  Empower Rune Weapon macro and rock on - the only reason it gets an A is because it lines up and is completely forgettable while bringing somewhat decent value."
    },
    "Frost Death Knight": {
      "tier": "A",
      "note": "2-minute Haste trinket that does for  Obliteration builds when paired with  Pillar of Frost and  Empower Rune Weapon."
    },
    "Unholy Death Knight": {
      "tier": "A",
      "note": "Another powerful on-use trinket that synergizes well with our 3-minute burst cooldowns. You'll end up holding this trinket for a 1 minute every time it comes up to use it with our 3-minute burst, making it slightly less powerful."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is an on-use trinket option that gives you a large amount of Haste that slowly decays over 20s. The trinket gives ten stacks of a buff, and you lose 1 stack every 2 seconds. As this is an on-use trinket, it can be completely controlled and lined up with damage cooldowns. This is a valid trinket option to use."
    },
    "Retribution Paladin": {
      "tier": "C",
      "note": "On use Haste buff. Use with  Avenging Wrath."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "Strength trinket with a Haste on-use effect. It’s pretty simple, and it’s okay."
    }
  },
  "Nightmare Egg Shell": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "The first of many disappointing stat sticks. This one is a boring, ramping haste proc. It's lackluster."
    },
    "Frost Death Knight": {
      "tier": "A-",
      "note": "Stronger for  Obliteration than  Breath of Sindragosa. Worth using if you pick one up early but falls behind other options at an equal item level"
    },
    "Unholy Death Knight": {
      "tier": "B",
      "note": "Gives passive Haste which is nice but doesn't give enough to be powerful. Will impact  Mirror of Fractured Tomorrows stats."
    },
    "Havoc Demon Hunter": {
      "tier": "F",
      "note": "Not a good havoc trinket, the proc is not good enough to run as is."
    },
    "Vengeance Demon Hunter": {
      "tier": "A-",
      "note": "Static Agility. 0.7 RPPM granting stacking haste for 20 seconds. Proc rate is a bit low and inconsistent, but the amount of haste provided is quite good. Note: Requires Havoc loot spec"
    },
    "Feral Druid": {
      "tier": "C",
      "note": "Stacking haste, but less haste than the other option. Eh."
    },
    "Guardian Druid": {
      "tier": "A",
      "note": "Passive agi with a bonus haste proc. We love agi, we love haste. Passive easy to use trinket."
    },
    "Survival Hunter": {
      "tier": "B",
      "note": "As with any Haste proc trinket, this is quite solid for us, if a bit uncontrollable."
    },
    "Protection Paladin": {
      "tier": "C",
      "note": "A random proc stat trinket. It will be very unreliable and something you won't be able to count on for any consistent offensive or defensive value."
    },
    "Retribution Paladin": {
      "tier": "C",
      "note": "Passive Haste proc buff."
    },
    "Assassination Rogue": {
      "tier": "C",
      "note": "Not only an undesirable stat, but also just not a great proc chance. The first trinket you should actively avoid"
    },
    "Outlaw Rogue": {
      "tier": "B",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "B",
      "note": "Haste remains the worse stat for the spec and the amount provided by the trinket does not make up for this deficit."
    },
    "Enhancement Shaman": {
      "tier": "B",
      "note": "The proc is nice when it happens giving an enormous bulk of Haste as it ramps up, and can be a solid pickup for Storm. Unfortunately, it has an extremely low proc rate and due to the time to get going it simply gets outpaced by other offerings."
    }
  },
  "Gore-Crusted Butcher's Block": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "Yet another stat stick. This one is a slightly overbudgeted crit proc."
    },
    "Frost Death Knight": {
      "tier": "A-",
      "note": "Good passive trinket but simply provides less benefit than other options."
    },
    "Unholy Death Knight": {
      "tier": "A",
      "note": "Solid passive trinket that procs Critical strike. Can also mess up  Mirror of Fractured Tomorrows stats so be wary of your exact raw stat values when using it!"
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is a purely damage focused trinket with passive primary stat and a critical strike rating proc. It is RNG and can happen outside of your cooldown window, but it should be a net damage gain in both single target and AoE situations. This is a good trinket option."
    },
    "Retribution Paladin": {
      "tier": "C",
      "note": "Passive Critical Strike proc buff."
    },
    "Protection Warrior": {
      "tier": "B",
      "note": "A simple strength trinket with a large Crit proc. Simple, but not bad."
    }
  },
  "Might of the Ocean": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "The 1min30 cooldown and lack of primary budget kills this trinket; you effectively end up losing 25% of its value as it is more valuable to delay it and send it with  Empower Rune Weapon."
    },
    "Frost Death Knight": {
      "tier": "A-",
      "note": "An okay active trinket. Nothing is particularly wrong with it but lags behind other options."
    },
    "Unholy Death Knight": {
      "tier": "A+",
      "note": "Your active alternative to  Mirror of Fractured Tomorrows. It has a shorter cooldown so will be used with every  Unholy Assault instead of every 3 minutes. This means that it doesn't synergise as well with our primary burst, but provides solid value throughout the fight. It's also really good for Mythic+ as our Burst windows there are every 90 seconds!"
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "An on-use strength trinket that you will use on cooldown for damage. Line it up with  Avenging Wrath to maximize its effect."
    },
    "Retribution Paladin": {
      "tier": "C",
      "note": "On use strength buff. Use with  Avenging Wrath."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "It's a 2-minute cooldown, on-use stat trinket that grants a lot of Strength. It’s okay."
    }
  },
  "Porcelain Crab": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "Another entry to the list of many disappointing stat sticks. This one is a boring mastery proc with a slice of avoidance on top, all of it on a low proc chance. It's lackluster."
    },
    "Frost Death Knight": {
      "tier": "A+",
      "note": "Universally good Mastery proc trinket. This will fit in any build for any content and do well."
    },
    "Unholy Death Knight": {
      "tier": "A",
      "note": "A passive trinket that provides a surprising amount of Mastery via the passive proc. A solid choice for a passive stat trinket everywhere."
    },
    "Havoc Demon Hunter": {
      "tier": "B+",
      "note": "A good passive mythic+ trinket option, giving high uptime on moderate mastery and avoidance."
    },
    "Vengeance Demon Hunter": {
      "tier": "C",
      "note": "Static Agility, 1.2 RPPM proc that grants Mastery and a small bit of avoidance. It's mediocre for a stat stick due to it being Mastery, and it's a random proc with roughly 20% uptime."
    },
    "Feral Druid": {
      "tier": "A",
      "note": "Just a stat proc trinket. Eventually someone is going to tell you this trinket is good because it gives you avoidance, they will be lying, but it's pretty good."
    },
    "Guardian Druid": {
      "tier": "A",
      "note": "Primary stat fantastic with a bonus mastery proc with fairly decent uptime. A good trinket if you don't want to track or have too many on-uses."
    },
    "Brewmaster Monk": {
      "tier": "B",
      "note": "Very simple stat proc trinket. The passive Agility is good, the Mastery and Avoidance proc is not. It’s one of the better options available from Mythic+ Season 3. This is not because it is good, but because the alternatives are bad."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is a random proc trinket that gives Mastery and Avoidance. Mastery and Avoidance are good stats that make you more tanky but the core issue with this trinket is that it's random and you can't control when you gain that defensive value. The trinket does have primary stat so it's a not complete waste to use but the random proc does put it below other options."
    },
    "Retribution Paladin": {
      "tier": "A (AoE)",
      "note": "Passive Mastery proc buff."
    },
    "Assassination Rogue": {
      "tier": "B",
      "note": "The avoidance is neat, but the trinket itself is just really weak outside of niche mythic+ situations"
    },
    "Outlaw Rogue": {
      "tier": "D",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "S",
      "note": "Is one of the best passive options of the patch, it is easier to obtain than the hightly contested  Pip's Emerald Friendship Badge while offering better consistency."
    },
    "Enhancement Shaman": {
      "tier": "S",
      "note": "A simple Mastery stat proc with a fairly high uptime, that even comes with some bonus Avoidance for free. Since we love Mastery both in single target and AoE, this is a great pick that's hard to go wrong with."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "Very simple stat proc trinket. The passive Strength is good, the Mastery and Avoidance proc is not."
    }
  },
  "Spiked Counterweight": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "This trinket has very questionable value depending on what you decide to do with it. It is a completely random proc chance, and its effect amplifies your damage up to a cap; this cap can technically be bypassed on the very last hit that bursts past it, making it a niche skillshot but otherwise unredeemable trinket."
    },
    "Frost Death Knight": {
      "tier": "C",
      "note": "Passive trinket that isn't tuned well enough to be good."
    },
    "Unholy Death Knight": {
      "tier": "C",
      "note": "Passive trinket that isn't tuned well enough to be good."
    },
    "Havoc Demon Hunter": {
      "tier": "F",
      "note": "The damage proc is too small to deal damage worth equipping as a haste trinket, not good in any content."
    },
    "Vengeance Demon Hunter": {
      "tier": "B+",
      "note": "Haste static. 0.92+Haste RPPM of dealing bonus damage and increasing all your damage dealt to that target by 15%, but it is hard capped based on the item level. Generally will always cap out this damage, so it can be pretty decent."
    },
    "Feral Druid": {
      "tier": "C",
      "note": "This trinket has been my example of \"bad trinket\" for 3 expansions now."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Passive haste with a good passive damage proc."
    },
    "Survival Hunter": {
      "tier": "C",
      "note": "This trinket can fall off fast if there's more than one target and even then, there are more appealing options in single-target or for priority adds."
    },
    "Brewmaster Monk": {
      "tier": "C-",
      "note": "Passive Haste and a moderate single-target damage proc with a fairly low procrate. It’s bad."
    },
    "Protection Paladin": {
      "tier": "B+",
      "note": "This has passive Haste, which we like, and applies a damage taken debuff, which we also like. The main issue is that the trinket is a random proc that can happen at any time, including outside of your burst window. And the damage cap on the damage taken debuff is low and will be consumed very quickly. This could be a trinket to use in single target raid situations."
    },
    "Retribution Paladin": {
      "tier": "F",
      "note": "Passive damage proc."
    },
    "Assassination Rogue": {
      "tier": "D",
      "note": "Really undertuned trinket frankly. The damage cap is just too low to actually make any impact, there's much much better options out there"
    },
    "Outlaw Rogue": {
      "tier": "C",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "D",
      "note": "Again a option with haste even tho the vulnerability effect sounds strong."
    },
    "Enhancement Shaman": {
      "tier": "D",
      "note": "This was bad in Legion and it's still true now. No primary stat, a pretty weak and infrequent proc that has the potential to fizzle alongside being entirely single target all make for a pretty bad pick. Avoid."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "The passive Haste is good, but the moderate single-target damage proc with a fairly low procrate is not."
    }
  },
  "Ashes of the Embersoul": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "Every 2min, you can use this trinket to gain a very significant amount of Strength, decaying over 20 seconds. When it expires, you lose the entire static budget of haste present on the trinket for 20 seconds.You also gain this effect when 40% of your group dies, up to once per combat, except that the version of the buff you get from this low-health effect does not decay. It's a shame that post-immune hotfix, this thing needs a 150-200% buff to be competitive."
    },
    "Frost Death Knight": {
      "tier": "A",
      "note": "A high amount of Strength every 2-minutes looks like it should be good for  Breath of Sindragosa but unfortunately the Haste reduction is too costly compared to the burst gained. However, this is strong for  Obliteration in Mythic+ and remains a worthwhile option in raid. The gained burst outweighs the downside when paired with  Pillar of Frost and  Empower Rune Weapon."
    },
    "Unholy Death Knight": {
      "tier": "A+",
      "note": "A strong 2-minute on-use trinket with an extra trigger effect. This has good synergy with our 3-minute burst windows (hold it for those)l. The passive proc when \"circumstances are dire\" comes into play when 40% or so of your current party dies, so won't provide a lot of value in the end. The Haste debuff afterwards isn't ideal but our non-burst DPS is low enough for it to not matter that much."
    },
    "Havoc Demon Hunter": {
      "tier": "A+",
      "note": "Can be used for a massive amount of Agility in burst windows around  Metamorphosis, however the base haste on the trinket devalues it pretty significantly. Exceptional in AoE scenarios, loses hard to good ST proc trinkets for single target scenarios however."
    },
    "Vengeance Demon Hunter": {
      "tier": "B-",
      "note": "Haste static. On use with 2 min cd that grants a huge amount of primary stat immediately(nearly doubling our mainstat), decaying by 15% every 3 seconds for 20 seconds. Once per combat, if much of your group has died, it can also proc the same effect that stacks with the on-use. After using the trinket, the haste is removed for 1 minute, so half the time it has roughly no static value."
    },
    "Feral Druid": {
      "tier": "S",
      "note": "With the buff to this trinket it's now about equal with Witherbarks as an on use option without needing micro optimisations.."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Lines up well with  Incarnation: Guardian of Ursoc and  Rage of the Sleeper, granting massive primary stat."
    },
    "Devastation Evoker": {
      "tier": "B",
      "note": "Strong on-use trinket with a  heavy downside."
    },
    "Augmentation Evoker": {
      "tier": "A",
      "note": "The significant on-use Intellect and 2 Min cooldown are appealing, but the downside is relevant and hurts this trinket's value. The \"dire circumstances\" secondary effect is not reliable. No Mastery or passive Intellect is also not ideal. This trinket is quite usable but appears to be a slightly worse version of  Balefire Branch."
    },
    "Beast Mastery Hunter": {
      "tier": "D",
      "note": "This is weaker than other on-use trinkets and doesn't work well alongside them. We also don't enjoy the drop in haste."
    },
    "Marksmanship Hunter": {
      "tier": "B",
      "note": "Decent On-Use Trinket."
    },
    "Survival Hunter": {
      "tier": "D",
      "note": "The huge primary bump is quite strong, but burning out after use for an entire minute can mean you're effectively only playing with a single trinket for half of combat. It also messes with small haste breakpoints, and depending on how much base haste you are running you may find yourself suddenly unable to fit in an extra GCD in a  Mongoose Fury,  Shrapnel Bomb, or  Pheromone Bomb window."
    },
    "Arcane Mage": {
      "tier": "A+",
      "note": "Not the best, not the worst on use option. Use with 20s remaining on siphon storm."
    },
    "Fire Mage": {
      "tier": "B",
      "note": "Strong on-use trinket with a  heavy downside."
    },
    "Frost Mage": {
      "tier": "C",
      "note": ""
    },
    "Brewmaster Monk": {
      "tier": "C+",
      "note": "A Haste trinket with an Agility on-use effect. It’s very bad for Monks."
    },
    "Protection Paladin": {
      "tier": "D",
      "note": "The on-use strength is very nice for burst damage and lining up with damage cooldowns. But the negative of losing Haste for a brief period is not worth it. Additionally, the proc aspect requires that you get to 15% HP, which can be quite dangerous as a tank. Proccing the HP threshold also resets your Haste debuff if you have one. This is a trinket to avoid."
    },
    "Retribution Paladin": {
      "tier": "A (AoE)",
      "note": "On use Strength buff that reduces the Haste the trinket provides for half of its cooldown. Use with  Avenging Wrath."
    },
    "Discipline Priest": {
      "tier": "A",
      "note": "\"Ramping\" trinket on a 2min cooldown, which may not work well with your 90 second cooldowns and the loss of haste may be a serious downside as this can reduce your  Smite casts and subsequent cooldown reduction needed."
    },
    "Shadow Priest": {
      "tier": "A-",
      "note": "This trinket's effect can be potent but the 60 second debuff is a hefty downside for a spec so reliant on haste. Line it up with  Power Infusion as both share 2 minute cooldowns."
    },
    "Assassination Rogue": {
      "tier": "A+",
      "note": "Almost an S-tier trinket, if not for the fact that  Witherbark's Branch exists in the loot pool. Since there is a shared cooldown between on-use trinkets, you would only ever use one of them. Because of that  Ashes of the Embersoul falls a tier as a still really good option, but sadly there's simply a better version. If you do have this trinket, it's important to use it 2-3 seconds into your  Kingsbane in order to take advantage of the decay effect."
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Lines up perfectly with our cooldowns.Applies a haste debuff you can remove with  Cloak of Shadows. Stat effect is doubled when dropping below 10% hp."
    },
    "Elemental Shaman": {
      "tier": "D",
      "note": "Getting main stat on use is in no way bad, but the burnout effect is too much of a drawback for this trinket to come into consideration."
    },
    "Enhancement Shaman": {
      "tier": "C+",
      "note": "While this looks appealing as a big on demand effect, the downside is pretty harsh. Even with the backup proc at a good time from dropping low triggers, it struggles to keep up as our damage isn't particularly frontloaded. If you need high burst on a 2-minute timer (which some encounters may lean into) this has potential, but can't quite keep up with easier to use alternatives."
    },
    "Protection Warrior": {
      "tier": "B+",
      "note": "A Haste trinket with a Strength on-use effect. It’s interesting, but the 1-minute anti-Haste debuff makes it effectively equivalent to not wearing a trinket half of the time. That kinda sucks!"
    }
  },
  "Caged Horror": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "The lack of strength and weak nature of the proc on this trinket outright kills it. There is no world in which you use this when  Rezan's Gleaming Eye does everything it does in a better way."
    },
    "Devastation Evoker": {
      "tier": "D",
      "note": "Passive trinket. Deals damage in a line."
    },
    "Augmentation Evoker": {
      "tier": "C",
      "note": "Passive Mastery is not strictly ideal, and the damaging effect has a low, unreliable proc rate. While dealing area damage in a line can be appealing in keys, this trinket has been known in the past to have issues with targeting and hitting enemies out of combat. Would suggest avoiding."
    },
    "Beast Mastery Hunter": {
      "tier": "C",
      "note": "A weak effect which doesn't make up for the lack of Agility."
    },
    "Marksmanship Hunter": {
      "tier": "A-",
      "note": "B-tier for single-target, but has immense AoE value as it is not split damage."
    },
    "Arcane Mage": {
      "tier": "F",
      "note": ""
    },
    "Fire Mage": {
      "tier": "B",
      "note": "Passive trinket."
    },
    "Frost Mage": {
      "tier": "C",
      "note": ""
    },
    "Shadow Priest": {
      "tier": "D",
      "note": "One of Shadow's worst passive trinket choices. There is potential for the beam to pass through and strike multiple targets but the width of the beam is very small and this makes it hard to consistently get value from. The damage is also just poor on its own without multiple hits."
    },
    "Elemental Shaman": {
      "tier": "B",
      "note": "Slightly better AoE choice but also heavily reliant on mob positioning."
    },
    "Affliction Warlock": {
      "tier": "D",
      "note": "Both the Mastery and damage effect sadly do not amount to much raw damage."
    },
    "Destruction Warlock": {
      "tier": "D",
      "note": "Both the Mastery and damage effect sadly do not amount to much raw damage."
    }
  },
  "Mirror of Fractured Tomorrows": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "The problem with this particular stat stick is the 3min cooldown it has. We have no way to align it with anything half of the time, causing us to lose a bunch of value on what would be a very big stat boost otherwise"
    },
    "Frost Death Knight": {
      "tier": "A+",
      "note": "3-minute on-use that provides a massive amount of secondary stats, something we love as Frost Death Knights. Although Frost has a relatively constant damage profile, the amount of secondary stats provided is enough to make this a good option. This is particularly good for content where you need to deal as much damage as you can within a short window."
    },
    "Unholy Death Knight": {
      "tier": "S",
      "note": "3-minute on-use that provides a massive amount of secondary stats, scaling well with our big 3-minute burst window of  Army of the Dead and  Summon Gargoyle! This trinket requires you to pay a lot of attention to your raw secondary stats as they will dictate which stat it procs. You want to have Mastery as your top raw stat for the pull use, and then either Haste or Mastery for any mid-fight uses. Remember that effect such as  Bloodlust that gives a % increase to a stat don't impact the raw value!"
    },
    "Havoc Demon Hunter": {
      "tier": "A",
      "note": "Gives a large critical strike buff and deals mediocre damage from the image, better in AoE than single target but an okay option in both."
    },
    "Vengeance Demon Hunter": {
      "tier": "B+",
      "note": "3 minute on-use that grants your highest secondary and summons a clone of you that performs different abilities. Cooldown is long and not powerful enough since we have nothing major that can be synced with it."
    },
    "Balance Druid": {
      "tier": "S",
      "note": "A very strong, 3 minute based option for Balance. Provides a lot of mastery when used."
    },
    "Feral Druid": {
      "tier": "A",
      "note": "This trinket's strength does vary a lot depending on your highest stat, Ideally you want it to proc mastery. Just a solid on use trinket."
    },
    "Guardian Druid": {
      "tier": "B",
      "note": "A powerful on-use 3 minute CD trinket granting massive secondary stats. Doesn't line up particularly great for us but can be used in niche situations."
    },
    "Restoration Druid": {
      "tier": "B-",
      "note": "Mirror is half big stat on-use and half random clone that spams low-value \"sand heals\". We can't really make very good use of either half so this is only good as a high item level fill-in until you get something more consistent."
    },
    "Devastation Evoker": {
      "tier": "A+",
      "note": "On-use with a long cooldown. Summons a minion that does minor damage and grants secondary stats. Used every other  Dragonrage."
    },
    "Preservation Evoker": {
      "tier": "B-",
      "note": "Mirror is a combination of a big stat proc and an awkward version of yourself that'll spam sand heals. It's tough to leverage trinkets with this long a cooldown and the clone doesn't do much. Consider this a temporary pick only."
    },
    "Augmentation Evoker": {
      "tier": "D",
      "note": "Passive Intellect and on-use Mastery with a small amount of direct damage. Somewhat deceptive in terms of practical value, the 3 Min cooldown is the biggest downside with this one, along with relatively underwhelming effects."
    },
    "Beast Mastery Hunter": {
      "tier": "S",
      "note": "A great on-use trinket with good stats. Line it up with  Call of the Wild whenever possible."
    },
    "Marksmanship Hunter": {
      "tier": "A+",
      "note": "Strong On-Use Trinket. Line up with  Trueshot whenever possible."
    },
    "Survival Hunter": {
      "tier": "A",
      "note": "A very powerful on-use that does damage as well as increases your highest secondary—usually critical strike or haste. Added bonus of lining up with every other Spearhead!"
    },
    "Arcane Mage": {
      "tier": "A+",
      "note": "This is our second best option for a trinket to pair with our cooldowns. Use with 20s remaining on siphon storm."
    },
    "Fire Mage": {
      "tier": "A",
      "note": "On-use with a long cooldown. Summons a minion that does minor damage and grants secondary stats."
    },
    "Frost Mage": {
      "tier": "A",
      "note": "Note that if your highest stat is currently critical strike, you should avoid this trinket if it would put you over the Frost Mage soft cap of 33.33% critical strike chance."
    },
    "Brewmaster Monk": {
      "tier": "B-",
      "note": "It's a 3-minute cooldown, on-use stat trinket. It can potentially be useful for dealing big bursts of damage, but it's not great, either."
    },
    "Mistweaver Monk": {
      "tier": "C",
      "note": "The major drawback of this trinket for us is that its cooldown is too long for the frequent casts of our Celestials. And pairing it with  Revival is out of the question, since it is likely going to grant us Haste, a secondary stat that gives no increase to its healing."
    },
    "Holy Paladin": {
      "tier": "B-",
      "note": "Grants a massive amount of your highest secondary stat. It is not bad, but its 3 minute cooldown is not ideal for Holy Paladin and you should probably trade it to your dps friends."
    },
    "Protection Paladin": {
      "tier": "B",
      "note": "This is an on-use with very high stat gain that likely to give you Haste or Critical Strike. This is a trinket to use for burst damage, especially to line up with your damage cooldowns. The only concern is potentially holding either damage cooldowns or holding the trinket due to de-syncing and the 3-minute cooldown."
    },
    "Retribution Paladin": {
      "tier": "B",
      "note": "On use secondary stat buff. Use with  Avenging Wrath."
    },
    "Discipline Priest": {
      "tier": "B",
      "note": "Stat bonus to your largest secondary"
    },
    "Holy Priest": {
      "tier": "B",
      "note": "Stat bonus to your largest secondary"
    },
    "Shadow Priest": {
      "tier": "C",
      "note": "This trinket can be a powerful burst option but Shadow does not tend to play well with 3 minute cooldowns, raid on use trinkets are also stronger."
    },
    "Assassination Rogue": {
      "tier": "A",
      "note": "This on-use might have a longer cooldown, but suits perfectly for the bursty playstyle of mythic+ where you are able to hold the trinket for the perfect pull. Because it doesn't line up with our cooldowns, you would not want to use it in Raids."
    },
    "Outlaw Rogue": {
      "tier": "B",
      "note": "Similar to the trinket above, this trinket also scales well with consistently large target counts compared to the other ones. I would only suggest either in extremely coordinated M+ groups."
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Very strong option, lines up well with cooldowns if playing  Invigorating Shadowdust."
    },
    "Elemental Shaman": {
      "tier": "C",
      "note": "Effectively identical to Nymue's trinket."
    },
    "Enhancement Shaman": {
      "tier": "A* / B",
      "note": "Provides a large amount of on demand secondaries (usually Mastery) that can be extremely useful for key burst moments. We don't really have any massive cooldown moments to align with it though, so is only good if you need quick access to damage that suits the cooldown and if using  Witherbark's Branch is too awkward. Otherwise, it's pretty average."
    },
    "Affliction Warlock": {
      "tier": "B",
      "note": "A relatively strong, 3 minute based option for Affliction. Does not pair with every Darkglare, but provides a large amount of stats when used."
    },
    "Demonology Warlock": {
      "tier": "A",
      "note": "Given you are able to pair this on use with every other Tyrant phase you can still consider this trinket to be very good."
    },
    "Destruction Warlock": {
      "tier": "A",
      "note": "Given you are able to pair this on use with every Infernal you can consider this trinket to be very good."
    },
    "Protection Warrior": {
      "tier": "B-",
      "note": "It's a 3-minute cooldown, on-use stat trinket. It can potentially be useful for dealing big bursts of damage, but it's not great, either."
    }
  },
  "Leaf of the Ancient Protectors": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "This is ward, but on a minute cooldown, with no primary stat (and instead a mastery budget), and it gives a pretty insane amount of vers to the recipient once the shield fades, if it fades entirely. You grab it, you smack it on yourself, and you get a tank trinket's and a half worth of tank trinkets. It's pretty good as far as tank trinkets go, but it is still weaker than the competition.Downside? You need to get it traded to you."
    },
    "Restoration Druid": {
      "tier": "D",
      "note": "Fairly poorly tuned and in a niche that requires tighter tuning to be useful. Likely to see rare play only - poor as a general use trinket."
    },
    "Preservation Evoker": {
      "tier": "F",
      "note": "This one just doesn't pass the minimum tuning standard for a trinket to be worth using. Expect buffs before it goes live."
    },
    "Mistweaver Monk": {
      "tier": "F",
      "note": "Worse than Ward."
    },
    "Holy Paladin": {
      "tier": "C",
      "note": "This trinket is not great. It does not have Intellect, but the shield is decently sized and on a short cooldown, so it could prove useful in very high mythic+ where you need it to live or help others live a specific mechanic."
    },
    "Protection Paladin": {
      "tier": "A",
      "note": "This is a purely defensive trinket. It has massive Mastery for damage reduction, gives you an absorb for spike damage, and some vers after it's consumed. It can have some value for situations with tank busters or specific mechanics to plan around. The use case is very narrow but is something to consider. Note: This only drops as Holy spec."
    },
    "Discipline Priest": {
      "tier": "F",
      "note": "Absorb shield that grants Vers to the ally affected."
    },
    "Holy Priest": {
      "tier": "F",
      "note": "Absorb shield that grants Vers to the ally affected."
    }
  },
  "Ward of Faceless Ire": {
    "Blood Death Knight": {
      "tier": "B",
      "note": "This is kept in this table because, on a pure defensive point of view, it is better than anything available in Season 3 if you need a 2min absorb. You can do some pretty silly things on yourself or on an ally with this. It's hard to justify, but it is a pretty low cooldown and can be used to cheese things."
    },
    "Mistweaver Monk": {
      "tier": "F",
      "note": "If you're still holding onto this trinket, hoping for a buff for this season, just vendor it for repair costs."
    }
  },
  "Prophetic Stonescales": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "For once, this expansion's cheat death trinket now has a strength budget, which makes it slightly less garbage than usual. It's still a very costly proposition, especially for a spec with nearly free access to  Purgatory. It procs before  Purgatory procs, as it has double the cooldown of it.Even on the highest level of keys in Season 2, this was taken as a placebo insurance policy by people, to the point that  Purgatory ended up never proccing in the overwhelming majority of their runs, making this a completely wasted trinket slot for them."
    },
    "Vengeance Demon Hunter": {
      "tier": "S(Niche)",
      "note": "Cheat Death trinket that also grants haste and damage reduction for 12 sec. This is extremely powerful in the right situations, but the vast majority of situations makes it unnecessary. It can be good for pushing keys as a safety net, and costs relatively less than taking our  Last Resort talent."
    },
    "Guardian Druid": {
      "tier": "B",
      "note": "A classic cheat death trinket with an 8 minute cooldown. Great in content where you're very uncomfortable as an extra safety net."
    },
    "Brewmaster Monk": {
      "tier": "B+",
      "note": "It's a Cheat Death trinket, with all the good and bad aspects that brings. Cheat Death trinkets are usually less effective overall than simply wearing a good defensive trinket. That being said, they are a perfect safety net when you are worried about dying. This is a particularly good Cheat Death trinket, because it grants stat budget and damage reduction when it procs. It's much stronger than the majority of Cheat Death trinkets from BFA and Shadowlands, which typically had downsides to the proc (Cheating Death and killing nearby players was hilarious!). It's also the only Cheat Death trinket available thus far in Dragonflight, so it's a singularly valuable trinket for its specific defensive purpose.Tl;dr: It's fine."
    },
    "Protection Paladin": {
      "tier": "A+",
      "note": "This is a very good cheat death trinket as it absorbs a very large killing blow, gives you haste, and reduces damage done to you for a short duration. It would be S tier, except that it's a cheat death trinket and like all similar effects, you can easily play around not having it for most content."
    },
    "Protection Warrior": {
      "tier": "B+",
      "note": "It's a Cheat Death trinket, with all the good and bad aspects that brings. Cheat Death trinkets are usually less effective overall than simply wearing a good defensive trinket. That being said, they are a perfect safety net when you are worried about dying. This is a particularly good Cheat Death trinket, because it grants stat budget and damage reduction when it procs. It's much stronger than the majority of Cheat Death trinkets from BFA and Shadowlands, which typically had downsides to the proc (Cheating Death and killing nearby players was hilarious!). It's also the only Cheat Death trinket available thus far in Dragonflight, so it's a singularly valuable trinket for its specific defensive purpose.Tl;dr: It's fine."
    }
  },
  "Writhing Heart of Darkness": {
    "Blood Death Knight": {
      "tier": "C",
      "note": "You can basically think of this as a flat ~10k damage reduction to every single damage event that comes from any mob that is in combat with you. It has very niche uses (very large numbers of very small damage events), but in practice, it's basically useless. You also pay extra for the privilege in the lack of Strength on it - less armor, less parry."
    },
    "Vengeance Demon Hunter": {
      "tier": "D",
      "note": "Crit static, with a proc that reduces damage from any target that we crit, stacking up to 3 times. Unfortunately, the damage reduction is negligible and close to no value. Note: Requires Vengeance loot spec"
    },
    "Guardian Druid": {
      "tier": "B",
      "note": "Passive Crit with a damage reduction effect that procs on mobs."
    },
    "Protection Paladin": {
      "tier": "D",
      "note": "This is a proc that reduces the damage that monsters do to you on critical strikes. The damage reduction is flat and not percentage based. What this means is that for lower content, it is particularly good, but it scales negatively as you go to more difficult content. This is the inverse of how defensive trinkets should work as you want to increase your damage reduction as content gets harder. I would avoid this trinket as its reduction is unreliable and it's better for content where you might not need it."
    }
  },
  "Xeri'tac's Unhatched Egg Sac": {
    "Blood Death Knight": {
      "tier": "F",
      "note": "This trinket should be the reason never to be in blood loot spec when opening your vault as blood, or running the Everbloom as blood. No primary stat budget and a proc that makes shadowlands trinket look better than this.Absolute bait trinket."
    },
    "Vengeance Demon Hunter": {
      "tier": "F",
      "note": "This trinket has no redeeming value. It has stamina baseline, with a 2+Haste RPPM proc that provides a tiny shield and summons an add that does a small bit of damage. Note: Requires Vengeance loot spec"
    },
    "Guardian Druid": {
      "tier": "F",
      "note": "Stam trinket with some interesting effects. Not fantastic."
    },
    "Brewmaster Monk": {
      "tier": "No",
      "note": "This is a really, really bad trinket that should never be used. It should not be in the game."
    },
    "Protection Paladin": {
      "tier": "F",
      "note": "This is a stamina trinket with a random proc absorb. Extra stamina beyond your normal gear is usually wasted and adds no defensive value. A random absorb effect can't reliably be used and depended on. This is a trinket to avoid."
    },
    "Protection Warrior": {
      "tier": "No",
      "note": "This is a really, really bad trinket that should never be used. It should not be in the game."
    }
  },
  "Idol of the Spell-Weaver/  Idol of the Life-Binder/  Idol of the Earth-Warder/  Idol of the Dreamer": {
    "Frost Death Knight": {
      "tier": "B-",
      "note": "A Jewelcrafting trinket can be a solid upgrade if you have a really low ilvl trinket. Generally, you'd choose from  Idol of the Earth-Warder,  Idol of the Dreamer or  Idol of the Life-Binder since we don't like versatility. Still, the lower ilvl of crafted gear and the general power of these trinkets means they are quite low in the B tier."
    },
    "Unholy Death Knight": {
      "tier": "B-",
      "note": "A Jewelcrafting trinket can be a solid upgrade if you have a low ilvl trinket. Generally, you'd choose either  Idol of the Earth-Warder or  Idol of the Dreamer since Haste and Mastery are our best stats. Still, the lower ilvl of crafted gear and the general power of these trinkets means they are quite low in the B tier."
    }
  },
  "Alacritous Alchemist Stone/  Sustaining Alchemist Stone": {
    "Frost Death Knight": {
      "tier": "B-",
      "note": "The Alchemy Stones are comparable to the Idol ones, you'd have to sim which one is the best upgrade."
    },
    "Unholy Death Knight": {
      "tier": "B-",
      "note": "The Alchemy Stones are comparable to the Idol ones, you'd have to sim which one is the best upgrade."
    }
  },
  "Darkmoon Deck Box: Dance/  Darkmoon Deck Box: Inferno": {
    "Frost Death Knight": {
      "tier": "B-",
      "note": "Inscription trinkets that generally are a bit behind the Alchemy and Jewelcrafting ones. Sim yourself and only really consider them if your current trinkets are really bad."
    },
    "Unholy Death Knight": {
      "tier": "B-",
      "note": "Inscription trinkets that generally are a bit behind the Alchemy and Jewelcrafting ones. Sim yourself and only really consider them if your current trinkets are really bad."
    }
  },
  "Witherbark's Branch": {
    "Havoc Demon Hunter": {
      "tier": "S-",
      "note": "Summons 3 orbs giving a stack of a massive amount of mastery per orb picked up, picking up each orb re-extends the buff to 10 seconds meaning you want to delay it out. Best to use in advance of cooldowns to be rolling between 2-3 stacks. BiS in single target and potent in AoE."
    },
    "Vengeance Demon Hunter": {
      "tier": "C",
      "note": "Static Agility, on-use with 2 minute cooldown that gives a large amount of Mastery. It's mediocre for a stat stick due to it being Mastery, though it performs very well offensively."
    },
    "Feral Druid": {
      "tier": "S",
      "note": "Feral's strongest on use trinket option. Lines up solidly with all our burst and we like Mastery."
    },
    "Guardian Druid": {
      "tier": "A",
      "note": "Flat agi which is always great, with an on-use mastery effect that lines up fairly well with  Incarnation: Guardian of Ursoc."
    },
    "Beast Mastery Hunter": {
      "tier": "A",
      "note": "A strong on-use trinket for Mythic+ without playing around it, but takes some kiting of the orbs to be good in raid, which might not be entierly realistic. A relatively easy way to play around it is to pick up two of the orbs instantly and then kite the third around in a circle, refreshing the buff last second."
    },
    "Marksmanship Hunter": {
      "tier": "S",
      "note": "Strongest On-Use Trinket. Better than, but also harder to use optimally than  Mirror of Fractured Tomorrows."
    },
    "Survival Hunter": {
      "tier": "B",
      "note": "Funnily enough despite our usual dislike for Mastery this lines up perfectly with  Coordinated Assault, which when paired with  Birds of Prey,  Explosive Shot and  Hunter Survival 10.2 Class Set 2pc actually does a fair amount of mastery-affected burst damage. This makes the mastery slightly less of a waste and effectively makes this trinket a less favourably tuned reversed  My'das Talisman, scaling okay in aoe but poorly in single target."
    },
    "Brewmaster Monk": {
      "tier": "B",
      "note": "An Agility trinket with a 2-minute on-use effect that grants Mastery. It’s fine, but not great.The competition from other Mythic+ trinkets is pretty bad, but just judging this trinket on its own merits: it’s also not great."
    },
    "Assassination Rogue": {
      "tier": "S+",
      "note": "Very strong trinket which gives an incredibly high amount of mastery. You will need to kite the orbs a little bit to maximize the effect however which can be a bit difficult. Make sure you pick up the orbs delayed. A common way you'll see this written is 1/1/7, where the number is the delay between picking up orbs (in seconds). 1/1/7 would mean you pick up the first 2 orbs very quickly, and wait 7 seconds for the last orb. For Assassination Rogue, macro the trinket into  Deathmark, and anything between 1/1/4 and 1/1/9 is perfectly fine. As long as you delay picking up the third orb, you're getting the max value out of the trinket. A common way to achieve that is instantly picking up the first two orbs, and letting the third naturally hit you."
    },
    "Outlaw Rogue": {
      "tier": "D",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "S",
      "note": "Probably the best Trinket of the patch. The orbs can be picked up delayed to extend the effect. The ideal use is to pick up two orbs and only pick up the 3rd shortly before the buff runs out."
    },
    "Enhancement Shaman": {
      "tier": "S*",
      "note": "A very powerful on demand Mastery option, but has to be played around. It spawns 3 orbs in a fixed pattern around you that take 5~ seconds to reach you, or you can catch them to trigger the buff. This effect does roll and can be staggered for up to 27 seconds, or grabbed quickly for an immediate 3 stack. You generally need 20 seconds total to compete with other trinkets, which can be difficult in hectic combat."
    }
  },
  "Bandolier of Twisted Blades": {
    "Havoc Demon Hunter": {
      "tier": "A",
      "note": "Requires repositioning to hit as many targets as possible in AoE, not the best in ST or AoE but relatively high in both scenarios."
    },
    "Vengeance Demon Hunter": {
      "tier": "A",
      "note": "Static Agility. On use with 1.5min cd that deals some Physical damage, then after a short delay, deals Shadowflame damage to all targets in a line between you and the original target. Tuned very competitively, but there are some drawbacks to be aware of. The cast range is only 6 yards, meaning you must use it on a melee target, then attempt to reposition so that the line damage hits as many targets as possible. The line is also quite narrow, so it can be difficult to land on multiple targets."
    },
    "Feral Druid": {
      "tier": "A",
      "note": "You click it it does damage."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Deals damage to a mob initially, you then have to line up yourself between the mob and other mobs you want it to hit as it is pulled from the initial mob back to you after 3 seconds dealing damage to everything between."
    },
    "Beast Mastery Hunter": {
      "tier": "A",
      "note": "This does good damage but requires you to be in melee to use. Ideally requires good positioning to get full value from in Mythic+ or AoE."
    },
    "Marksmanship Hunter": {
      "tier": "B",
      "note": "Good Single-target Trinket with some mild AoE scaling, but requires you to be in melee for its use every 90 seconds."
    },
    "Survival Hunter": {
      "tier": "S",
      "note": "Respectable single-target damage for an AoE trinket. Maximizing it in AoE generally works fairly well with how we naturally position ourselves, although it technically performs a tiny bit worse than the other trinkets in the S tier section the difference is incredibly tiny, and the trinket is very versatile."
    },
    "Brewmaster Monk": {
      "tier": "A+",
      "note": "On-use damage trinket. It deals damage to the primary target, then boomerangs a blade from them to you, splitting damage with every enemy along the way. It’s not complicated, and the damage is good."
    },
    "Assassination Rogue": {
      "tier": "A-",
      "note": "Only useful in AoE such as Mythic+, the on-use active can be quite strong when hitting many enemies. Can be tricky to use however and doesn't really have a niche"
    },
    "Outlaw Rogue": {
      "tier": "S",
      "note": "This trinket reads a lot weirder than it actually performs. Realistically it's just a damage on use trinket."
    },
    "Subtlety Rogue": {
      "tier": "B",
      "note": "Strong Single Target trinket with a splash mechanic that is hard to play around."
    },
    "Enhancement Shaman": {
      "tier": "A-",
      "note": "Deals a large amount of upfront damage quickly, but the awkward cooldown means like many direct damage trinkets this expansion we don't have any unique reason to grab it. Just off numbers alone though, it's an ok pickup."
    }
  },
  "My'das Talisman": {
    "Havoc Demon Hunter": {
      "tier": "A-",
      "note": "Good single target damage with zero AoE value, typically not recommended but can be decent temporarily for raid."
    },
    "Vengeance Demon Hunter": {
      "tier": "B+",
      "note": "Static Agility. On-use with a 1.5min cd that makes your next 5 auto-attacks deal bonus Physical damage. Purely Single Target."
    },
    "Feral Druid": {
      "tier": "A",
      "note": "This trinket got a pretty substantial buff so now it's a pretty solid option."
    },
    "Guardian Druid": {
      "tier": "A+",
      "note": "Flat agi with an on-use effect that causes your next 5 melee swings to deal extra damage."
    },
    "Beast Mastery Hunter": {
      "tier": "B",
      "note": "This is simply a weaker on-use that only really works on single-target."
    },
    "Marksmanship Hunter": {
      "tier": "C",
      "note": "Decent Single-Target Damage Dealing Trinket."
    },
    "Survival Hunter": {
      "tier": "S",
      "note": "This is an incredibly powerful trinket since the most recent buff and it gives a nice and predictable boost to your damage every 90 seconds, it does not scale into AoE whatsoever, so its performance drops off in m+ but it will still serve you well."
    },
    "Brewmaster Monk": {
      "tier": "A",
      "note": "The worst trinket from BFA is back, but it has been buffed by a lot!. It's really boring, but it deals a lot of damage in single-target situations. It's great in sims! Is it just simbait? A little. A 90s CD trinket is going to be overrepresented in 5m Patchwerk sims. Is it actually any good? Eh, it's a good ST target, and pretty weak for AoE."
    },
    "Assassination Rogue": {
      "tier": "A",
      "note": "After the massive buffs this trinket received, it's been performing quite well. I generally wouldn't recommend it over the better on-use trinkets such as  Ashes of the Embersoul or  Witherbark's Branch, but it's a good trinket until you have one of those"
    },
    "Outlaw Rogue": {
      "tier": "S",
      "note": ""
    },
    "Subtlety Rogue": {
      "tier": "A",
      "note": "Strong option only on single-target."
    },
    "Enhancement Shaman": {
      "tier": "A-",
      "note": "This trinket was pretty bad back in BfA, but it got some major buffs that makes it more desirable. We don't really have anything to amp it though, and the 1.5 minute cooldown doesn't naturally fit in as well as other options, alongside being purely single target"
    }
  },
  "Darkmoon Deck: Watcher": {
    "Vengeance Demon Hunter": {
      "tier": "B",
      "note": "Grants a shield on use, and a short buff. If the shield depletes during the buff, you gain a small amount of vers for the same buff duration. Outscaled by most other trinkets at this point."
    }
  },
  "Alacritous Alchemist Stone": {
    "Vengeance Demon Hunter": {
      "tier": "B+",
      "note": "A decent choice if you don’t have any better trinkets. It gives static Haste, a large amount of Agility with 1.5rppm, and reduces combat potion cooldown by 10 sec on procs."
    },
    "Beast Mastery Hunter": {
      "tier": "B",
      "note": "A smaller stat proc but also reduces the cooldown of combat pots, which lets you gain extra uses in niche raid situations and in Mythic+. Requires a  Spark of Dreams to make."
    },
    "Holy Paladin": {
      "tier": "B-",
      "note": "Crafted through Alchemy, this is a simple proc trinket. It's proc has decent uptime and the Potion cooldown reduction allows us to get more Potions in on most fights."
    },
    "Subtlety Rogue": {
      "tier": "C",
      "note": "The Haste on the trinket do make it a considerable weak crafted trinket option."
    },
    "Enhancement Shaman": {
      "tier": "C+",
      "note": "Both Alchemist Stones are extremely basic boosts that, while not awful, just aren't strong enough to pull their weight compared to alternatives, and especially not enough to justify a spark. They've only dropped in performance thanks to the relative power of  Elemental Potion of Ultimate Power  remaining the same throughout Dragonflight."
    }
  },
  "Sustaining Alchemist Stone": {
    "Vengeance Demon Hunter": {
      "tier": "B-",
      "note": "A decent choice if you don’t have any better trinkets. It gives static Versatility, a large amount of Agility with 1.5rppm, and extends your phial by 1 minute on procs."
    },
    "Restoration Druid": {
      "tier": "C+",
      "note": "Neither alchemy stone will see much play this tier since if you want a crafted option, then you're better off with an Idol."
    },
    "Preservation Evoker": {
      "tier": "B-",
      "note": "Realistically you'd rather craft one of the Idols than this and it ends up being a slightly worse version of them."
    },
    "Beast Mastery Hunter": {
      "tier": "A",
      "note": "A simple big stat proc. Requires a  Spark of Dreams to make."
    },
    "Holy Paladin": {
      "tier": "B-",
      "note": "Crafted through Alchemy, this is a simple proc trinket. It's proc has decent uptime, and grant a good amount of intellect."
    },
    "Discipline Priest": {
      "tier": "A",
      "note": "Solid passive stat trinket."
    },
    "Holy Priest": {
      "tier": "A",
      "note": "Solid passive stat trinket."
    },
    "Subtlety Rogue": {
      "tier": "B",
      "note": "Solid stat stick."
    }
  },
  "Darkmoon Deck Box: Dance": {
    "Vengeance Demon Hunter": {
      "tier": "C-",
      "note": "Similar to monk's  Chi Wave but in trinket form. Not too great as it splits damage and healing."
    },
    "Marksmanship Hunter": {
      "tier": "B",
      "note": "Decent Single-Target Trinket. Requires a  Spark of Dreams to make."
    },
    "Outlaw Rogue": {
      "tier": "A",
      "note": "A good trinket but can be a bit awkward to use and also costs a  Spark of Dreams."
    },
    "Subtlety Rogue": {
      "tier": "C",
      "note": ""
    },
    "Enhancement Shaman": {
      "tier": "C",
      "note": "Similar to the Inferno card, it deals solid on demand burst to a target and some negligible off-healing. Its one advantage is that it can Critically Strike, making it the better of the two cards. You should craft this with an  Emberscale Sigil ."
    }
  },
  "Storm-Eater's Boon": {
    "Vengeance Demon Hunter": {
      "tier": "A+++ (AoE)/D (ST)",
      "note": "This is still a very strong trinket if at Mythic item level from the first tier specifically in AoE. Reduces your movement to 1%, roots you, and deals an absurd amount of uncapped AoE damage over 10 seconds. You can cast regular abilities while this is occurring. Only reason this isn't S tier for AoE is because it's extremely risky being uncancellable for 10 seconds. Note: Requires Havoc loot spec from the first tier!"
    }
  },
  "Darkmoon Deck Box: Inferno": {
    "Vengeance Demon Hunter": {
      "tier": "B+",
      "note": "1.5 min cd on random damage depending on the card drawn. Can control which card is shuffled with Sigils. Damage appears to be relatively lackluster."
    },
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    },
    "Enhancement Shaman": {
      "tier": "C",
      "note": "Very basic effect that's both volatile depending on the card drawn when you want to use it, and entirely single target. This just struggles to keep up with much stronger offerings as the seasons have gone on so I wouldn't recommend wasting sparks on it. You should craft this with an  Emberscale Sigil "
    }
  },
  "Darkmoon Deck Box: Rime": {
    "Vengeance Demon Hunter": {
      "tier": "C",
      "note": "Deals instant damage and applies a debuff for various duration, depending on the shuffled card. If the target dies during this debuff, then it explodes. A bit tricky to use on cooldown as it may not get full value."
    },
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    }
  },
  "Balefire Branch": {
    "Balance Druid": {
      "tier": "A",
      "note": "The second best on use trinket for Balance Druid currently. It is still quite powerful, but MIrror is generally a better option."
    },
    "Devastation Evoker": {
      "tier": "A",
      "note": "On-use. Taking damage removes stacks of your buff."
    },
    "Augmentation Evoker": {
      "tier": "A",
      "note": "Excellent on-use trinket providing passive Mastery and on-use Intellect which translates directly into  Ebon Might value. Can be used with  Breath of Eons every two minutes, or flexibly as fight timers require.I've dropped this from S-tier to A-tier simply because certain bosses in the Amirdrassil raid (such as Smolderon) have been found to burn away charges more quickly than expected through frequent ticking damage mechanics. This is still the strongest trinket available from Mythic+, and is still a very powerful on-use trinket, especially in fights where you are not taking repeated ticking damage.This is likely still a top trinket specifically for Mythic+, given that on-use stats generally scale better than single-target damage effects, and that the incoming damage profile is generally less punishing."
    },
    "Arcane Mage": {
      "tier": "S",
      "note": "This is our strongest trinket to pair with our cooldowns. Use this the first time when siphon storm has 20s remaining, the second time as soon as its available during burst, and then hold it for one burn, rinse repeat."
    },
    "Fire Mage": {
      "tier": "B+",
      "note": "On-use. Taking damage removes stacks of your buff."
    },
    "Frost Mage": {
      "tier": "A",
      "note": ""
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "On-use intellect that should synergize well with a \"Full UP\" talent setup that values larger 90 second ramps, see talent guide/rotation page for more. This will still be valuable with a more 30-sec centric build but perhaps not as valuable as passive trinkets when your ramp value is more spread out and less concentrated on 90 sec timers."
    },
    "Holy Priest": {
      "tier": "B",
      "note": "On-use intellect that can be used with  Divine Hymn or  Holy Word: Salvation."
    },
    "Shadow Priest": {
      "tier": "A",
      "note": "This is Shadow's most potent on use trinket from dungeons, though it has potential for reduced value if you are taking heavy damage while it is active."
    },
    "Elemental Shaman": {
      "tier": "S",
      "note": "We scale very well with Mastery in general and the Intellect on-use is high enough to outclass most other available trinkets."
    },
    "Affliction Warlock": {
      "tier": "A",
      "note": "Another great on-use option for Affliction Warlocks. Brings baseline Mastery with an on-use Intellect effect."
    },
    "Demonology Warlock": {
      "tier": "A-",
      "note": "If you are not able to get one of the S tier trinkets, this is a great option and still provides a hefty amount of Intellect on demand."
    },
    "Destruction Warlock": {
      "tier": "A+",
      "note": "A great alternative to the two strongest trinket is the on-use intellect trinket from dungeons. This also has potential to even beat out one of the other trinkets, depending on the situation."
    }
  },
  "Coagulated Genesaur Blood": {
    "Balance Druid": {
      "tier": "B",
      "note": "An okay equip based option which provides baseline intellect and a Critical Strike proc. Mostly good on Single Target, but also okay on AOE. 2nd best Dungeon Trinket"
    },
    "Restoration Druid": {
      "tier": "A",
      "note": "A standard crit proc stat stick. You can expect around 30% uptime on the crit buff."
    },
    "Devastation Evoker": {
      "tier": "B-",
      "note": "Passive crit buff."
    },
    "Preservation Evoker": {
      "tier": "A",
      "note": "This is a very typical stat stick. You can expect around 30% uptime on the crit buff."
    },
    "Augmentation Evoker": {
      "tier": "B",
      "note": "Passive Intellect is always valuable. Critical Strike proc at one proc per minute is not ideal, but does provide some value."
    },
    "Arcane Mage": {
      "tier": "B",
      "note": "Love crit."
    },
    "Fire Mage": {
      "tier": "B-",
      "note": "Passive trinket."
    },
    "Frost Mage": {
      "tier": "C",
      "note": ""
    },
    "Mistweaver Monk": {
      "tier": "A",
      "note": "This is a trinket that does something so simple, but it does it very well; it gives us a desirable secondary stat. Fairly consistently."
    },
    "Holy Paladin": {
      "tier": "A",
      "note": "A simple proc trinket. It has Intellect with an Crit proc with decent uptime."
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "Strong stat stick that features a heavy proc with low uptime. This would be more desirable in a more Bender-centric build where your near-30sec ramps would be more likely to receive value from the limited (but powerful uptime)."
    },
    "Holy Priest": {
      "tier": "S",
      "note": "Strong stat stick that features a heavy proc with low uptime."
    },
    "Shadow Priest": {
      "tier": "A-",
      "note": "This is another solid passive trinket option from dungeons. It might even better for you than Sea Star depending on your other items."
    },
    "Elemental Shaman": {
      "tier": "A-",
      "note": "While crit isn't particularly wanted for us, this trinket seems to be performing a lot better than expected."
    },
    "Affliction Warlock": {
      "tier": "B",
      "note": "A decent equip based option which provides baseline intellect and a Critical Strike proc."
    },
    "Demonology Warlock": {
      "tier": "C",
      "note": "While the proc on this trinket is a good stat, it is for a generally short duration and may not line up effectively with your cooldown phases."
    },
    "Destruction Warlock": {
      "tier": "C",
      "note": "While the proc on this trinket is a good stat, it is for a generally short duration and may not line up effectively with your cooldown phases."
    }
  },
  "Belor'relos, the Suncaller": {
    "Balance Druid": {
      "tier": "B",
      "note": "An exceptionally powerful, damage based on-use trinket. It does however, require you to be in melee and deals damage back to you."
    },
    "Devastation Evoker": {
      "tier": "S-",
      "note": "AoE Trinket that damages you and nearby enemies after a short cast. Stronger in AoE."
    },
    "Augmentation Evoker": {
      "tier": "S",
      "note": "Passive Intellect and a strong on-use damage effect. On-use can be used in place of filler during rotation downtime, so this works well as a second on-use trinket. The on-use damage effect requires you to be within roughly 10 yards of any enemy targets.Easily the single strongest trinket available for Augmentation, and playstyle is not significantly affected as Augmentation frequently has to play in or around melee range due to its limited spell range and proximity targeting mechanics."
    },
    "Arcane Mage": {
      "tier": "S",
      "note": "Our best \"passive\" trinket to pair with an on use, even though this has a use effect we don't use it during cooldowns since the damage doesn't scale with our buffs, keep in mind several things for this trinket, it requires near melee range, is castable while moivng, and can be activated during the global cooldown. Use this after cooldowns run out completely."
    },
    "Fire Mage": {
      "tier": "S+",
      "note": "AoE Trinket that damages you and nearby enemies after a short cast. Stronger in AoE."
    },
    "Frost Mage": {
      "tier": "A",
      "note": "This trinket has a very strong on-use effect, especially against a single target. However, it only has a 10-yard range, which can make it difficult to use for Frost Mages."
    },
    "Shadow Priest": {
      "tier": "S",
      "note": "Shadow's strongest on use trinket from the raid, providing large direct damage but unfortunately requiring you to stand at close range."
    },
    "Elemental Shaman": {
      "tier": "S-",
      "note": "Very good all around trinket. Highest Single Target damage but falls off on higher target counts."
    },
    "Affliction Warlock": {
      "tier": "S",
      "note": "An exceptionally powerful, damage based on-use trinket. It does however, require you to be in melee and deals damage back to you."
    },
    "Demonology Warlock": {
      "tier": "S",
      "note": "The best overall option for Demonology, this is a very powerful on use trinket however it will require you to be in melee and does damage to you when used."
    },
    "Destruction Warlock": {
      "tier": "S",
      "note": "The strongest trinket option for Destruction, as well as the other Warlock specs. The only downside of this, is you're required to be near your target in order to deal damage with the trinket."
    }
  },
  "Nymue's Unraveling Spindle": {
    "Balance Druid": {
      "tier": "B",
      "note": "The effect is a 3 second channel, but does substantial damage while providing a good bit of Mastery."
    },
    "Devastation Evoker": {
      "tier": "S+",
      "note": "Trinket requires channeling. Mastery buff increases the longer you channel."
    },
    "Augmentation Evoker": {
      "tier": "S",
      "note": "Passive Intellect with strong on-use Mastery and direct damage on a 2 Min cooldown. Channel time can feel disruptive to use during active cooldowns, but many ideal buff targets in Season 3 are not negatively affected by a short delay before casting  Breath of Eons. The damage dealt by this trinket is quite strong, and deals additional damage to immobilized targets, which includes a handful of Amirdrassil raid bosses."
    },
    "Arcane Mage": {
      "tier": "A+",
      "note": "A good option for specific fight timings and if you don't have Mirror, make sure you channel it fully for the biggest mastery buff. You can use this before any radiant spark cast (even miniburns)."
    },
    "Fire Mage": {
      "tier": "S-",
      "note": "Trinket requires channeling. Mastery gained increases with duration."
    },
    "Frost Mage": {
      "tier": "C",
      "note": "While this trinket provides mastery that can be synced with  Icy Veins, having to stop to channel it results in overall damage that does not keep up with other active stat trinkets."
    },
    "Discipline Priest": {
      "tier": "B",
      "note": "On-use with a 3 second channel that significantly hampers uptime when ramping."
    },
    "Shadow Priest": {
      "tier": "A",
      "note": "This is Shadow's second strongest on use trinket from the raid. It provides a strong burst of mastery but requires you to channel for a few seconds and is signficantly devalued in AoE / Mythic+. A strong option if you cannot get into melee range consistently."
    },
    "Elemental Shaman": {
      "tier": "C",
      "note": "Mastery on cooldown trinkets are particularly bad for us because we either need to run sub 70% Mastery or waste most of its value."
    },
    "Affliction Warlock": {
      "tier": "S",
      "note": "Your best on-use stat based trinket for the patch. The effect is a 3 second channel, but does substantial damage while providing a good bit of Mastery."
    },
    "Demonology Warlock": {
      "tier": "S",
      "note": "Even though this is another on use trinket, it is our 2nd best option and the best on use stat based trinket, there is the wind up time for the effect to become active (3s) but the Mastery gain is worth it."
    },
    "Destruction Warlock": {
      "tier": "S",
      "note": "Even though this is another on use trinket, it is our 2nd best option and the best on use stat based trinket, there is the wind up time for the effect to become active (3s) but the Mastery gain is worth it, as Mastery is one of Destructions best stats."
    }
  },
  "Sea Star": {
    "Balance Druid": {
      "tier": "C",
      "note": "Provides baseline Versatility with a proc Intellect effect. With their being so many on-use based trinkets this tier, there are simply better options."
    },
    "Restoration Druid": {
      "tier": "A",
      "note": "A stat trinket. You'll get about 35% uptime on the intellect proc."
    },
    "Devastation Evoker": {
      "tier": "A-",
      "note": "Decent and straightforward passive intellect trinket."
    },
    "Preservation Evoker": {
      "tier": "A",
      "note": "Another fairly standard stat stick. You'll get about 35% uptime on the int proc. Note that this trinket is more proc-heavy than  Coagulated Genesaur Blood which gives you more of its power passively."
    },
    "Augmentation Evoker": {
      "tier": "B",
      "note": "Passive Versatility here is not ideal, but the Intellect proc actually has decent uptime at about 1.5 procs per minute, making this trinket a reasonable choice in a pinch."
    },
    "Arcane Mage": {
      "tier": "C",
      "note": "Pretty even with the above."
    },
    "Fire Mage": {
      "tier": "A",
      "note": "Passive intellect trinket."
    },
    "Frost Mage": {
      "tier": "B",
      "note": ""
    },
    "Mistweaver Monk": {
      "tier": "A",
      "note": "Nothing too special about this trinket. It's a baseline amount of Versatility with fairly frequent uptime on an Intellect buff."
    },
    "Holy Paladin": {
      "tier": "A",
      "note": "A simple proc trinket. It has Versatility with an Intellect proc with decent uptime."
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "Strong passive primary stat proc with ~33% uptime."
    },
    "Holy Priest": {
      "tier": "S",
      "note": "Strong passive primary stat proc with ~33% uptime"
    },
    "Shadow Priest": {
      "tier": "A-",
      "note": "Shadow's best passive trinket from dungeons. A solid fire and forget choice that can be paired with any of the above trinkets."
    },
    "Elemental Shaman": {
      "tier": "S",
      "note": "Very solid all-around trinket. While a bit boring, passive vers works well for us and the on-proc Intellect is big enough for this trinket to be one of the default choices next season."
    },
    "Affliction Warlock": {
      "tier": "B",
      "note": "Provides baseline Versatility with a proc based Intellect effect. Pairs well with an on-use trinket and is a solid option outside of Vessel from M+."
    },
    "Demonology Warlock": {
      "tier": "D",
      "note": "This trinket was changed to be a PPM based proc trinket available this season, with it being 1.5 PPM this trinket can have some value for Demonology but is not preferred over an on use trinket."
    },
    "Destruction Warlock": {
      "tier": "B",
      "note": "Provides baseline Versatility with an on-use Intellect effect. Strong during cooldowns, and better when playing the 2-minute build rather than the 3-minute build."
    }
  },
  "Other Trinkets": {
    "Balance Druid": {
      "tier": "D",
      "note": "A lot of the other trinkets are quite poor and I would recommend gathering other options. The trinkets that are not listed could be used early on in the patch if you have no other options, but you are not thrilled to have them."
    }
  },
  "Oakheart's Gnarled Root": {
    "Guardian Druid": {
      "tier": "S",
      "note": "Flat Vers with a passive damage proc that deals massive damage fairly consistently. Very good for us although it is a balance trinket."
    },
    "Devastation Evoker": {
      "tier": "B",
      "note": "Passive trinket. Deals damage and slows."
    },
    "Augmentation Evoker": {
      "tier": "D",
      "note": "While the damaging effect is at least reasonably consistent, passive Versatility really holds this trinket back. There are simply better damage proc alternatives."
    },
    "Beast Mastery Hunter": {
      "tier": "C",
      "note": "An unimpressive damage proc which does not make up for the lack of Agility."
    },
    "Marksmanship Hunter": {
      "tier": "A",
      "note": "Strong Single-Target Trinket"
    },
    "Arcane Mage": {
      "tier": "B-",
      "note": ""
    },
    "Fire Mage": {
      "tier": "A",
      "note": "Passive trinket."
    },
    "Frost Mage": {
      "tier": "C",
      "note": "This trinket focuses on single target damage."
    },
    "Shadow Priest": {
      "tier": "D",
      "note": "Another exceptionally weak passive trinket, dealing only single target damage and being surprisingly undertuned compared to other options. The main stat Versatility also makes this a very undesirable option for Shadow. You should run Darkheart Thicket dungeons in Holy loot spec to avoid being able to accidentally loot this trinket."
    },
    "Elemental Shaman": {
      "tier": "C",
      "note": "This trinket only work in Single Target and is not tuned high enough to be relevant. Skip."
    },
    "Affliction Warlock": {
      "tier": "C",
      "note": "Another equip, damage based trinket that Affliction can use to decent success in single target."
    },
    "Destruction Warlock": {
      "tier": "C",
      "note": "Damage proc based trinket. Not terrible, but not something you're actively looking for."
    }
  },
  "Echoing Tyrstone": {
    "Restoration Druid": {
      "tier": "A",
      "note": " Echoing Tyrstone is kind of the best of a rough batch of trinkets. It can be a little annoying to use, but it can also save a wipe, and having a few of them through your raid is quite strong. Its value comes from a mix of the heal (which is 75% higher than the tooltip) and a huge haste buff across your raid. Expect it to contribute 3-4% healing if you're able to proc the effect often."
    },
    "Preservation Evoker": {
      "tier": "A",
      "note": " Echoing Tyrstone provides a great mix of HPS and haste for your group. It can easily save a bad pull and given the alternatives are quite weak this tier, that ability is very much worth it. If your pull timers are a bit slow you can also pre-charge it before combat to get an extra use!"
    },
    "Mistweaver Monk": {
      "tier": "A+",
      "note": "While this trinket does have a decently infrequent cooldown, the effect can be used to instantly burst a group of players up after a painful damage spike, followed by a decent bit of Haste on all affected players after the heal."
    },
    "Holy Paladin": {
      "tier": "A",
      "note": "With this trinket, you use the active effect to store healing, which then automatically gets used to heal the first ally that falls below 35% health and nearby allies, splitting the stored amount between them. The main value of this trinket is the haste it gives to the group when it heals."
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "Strong output trinket that requires you to \"charge\""
    },
    "Holy Priest": {
      "tier": "S",
      "note": "Strong output trinket that requires you to \"charge\" the ability by using in moments of heavy healing where it will then passively heal low-health players later on."
    }
  },
  "Idol of the Dreamer": {
    "Restoration Druid": {
      "tier": "A",
      "note": "Idol of the Dreamer is quite good. However, our best gear setup will already be quite invested into Haste which pushes this into diminishing returns territory and we won't want to spend an early craft on a trinket."
    },
    "Beast Mastery Hunter": {
      "tier": "A",
      "note": "This performs great but 1) Requires sockets to get full value so might not immediately be viable and 2) Forces you to ideally run similar gems which might lose you damage elsewhere. 3) Requires a  Spark of Dreams to make."
    },
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    }
  },
  "Amalgam's Seventh Spine": {
    "Restoration Druid": {
      "tier": "B+",
      "note": "Severely nerfed from its old glory days, but still an appropriate tool for Resto Druid specifically. Procs on all hard cast  Rejuvenation,  Germination and  Regrowth casts. Does not interact with  Luxuriant Soil procs. At max level, you can expect to get about 10% more rejuvenation casts through a fight from it."
    },
    "Preservation Evoker": {
      "tier": "D",
      "note": "Mana trinkets are decent in general but we'll need to cast  Living Flame or  Echo on allies in order to proc it. It's tuned around casting those spells a ton and we're just not going to be doing that.  Echo builds are also already quite mana efficient. Doesn't proc on  Echo'd  Living Flames."
    },
    "Holy Paladin": {
      "tier": "C",
      "note": "This trinket makes your  Holy Light and  Flash of Light return a small amount of mana after 6 seconds. Even if you play a build where cast  Flash of Light this mana return is not high enough to make this trinket attractive."
    },
    "Discipline Priest": {
      "tier": "B",
      "note": "Int with mana regen, not quite synergistic with Disc's playstyle."
    },
    "Holy Priest": {
      "tier": "B",
      "note": "Int with mana regen that is activated from  Flash Heal/ Heal. Since those abilities are not heavily used in raids the mana regen is less valuable."
    }
  },
  "Ominous Chromatic Essence": {
    "Restoration Druid": {
      "tier": "B",
      "note": "A great pick for your first few weeks while you look for a better trinket. Will start to drop off hard as the rest of your raid unequips it."
    },
    "Preservation Evoker": {
      "tier": "B",
      "note": "The second best trinket last season holds up ok here until you're able to farm higher item level alternatives."
    },
    "Fire Mage": {
      "tier": "C",
      "note": "Season 2. Passive trinket. With all buffs from allies it moves to B-"
    },
    "Mistweaver Monk": {
      "tier": "C",
      "note": "Compared to a typical stat stick trinket, this trinket gives more raw secondary stats. This trinket will start off the season strong, but as more members of your group find better trinkets and unequip their own versions of this trinket, it's power will start falling off, independent of your own trinket luck."
    }
  },
  "Rashok's Molten Heart": {
    "Restoration Druid": {
      "tier": "B",
      "note": "Last tiers powerhouse has been nerfed three times now but it's still an acceptable early pick while you farm higher item level trinkets."
    },
    "Preservation Evoker": {
      "tier": "B",
      "note": "Rashok's has been hit with three severe nerfs and still hangs around in mid-tier. You'll wear it for the first week and then replace it when you can get a higher item level alternative that's higher on this list."
    },
    "Mistweaver Monk": {
      "tier": "C",
      "note": "This absolute light in the darkness this trinket was in Season 2 has dimmed. All of the effects tied to its proc have been decimated going into Season 3. It'll be strong for us as we find a worthy replacement, and when that comes, we can retire it to our Void Storage in peace, to rest alongside other magnificent trinkets of the past."
    }
  },
  "Lady Waycrest's Music Box": {
    "Restoration Druid": {
      "tier": "B-",
      "note": "An ok trinket in Mythic+ where we're able to spend more time DPSing but in raid this is just a poor healing proc trinket."
    },
    "Devastation Evoker": {
      "tier": "C",
      "note": "Passive damage and healing proc trinket."
    },
    "Preservation Evoker": {
      "tier": "B",
      "note": "As an Evoker we should have no issue getting maximum value out of both the DPS and healing procs from the music box, but it just doesn't offer enough throughput to be a top tier trinket."
    },
    "Augmentation Evoker": {
      "tier": "B",
      "note": "Passive Intellect and direct damage for solid value, with a proc rate of around three per minute. The healing effect also procs independently, which is a nice bonus as Augmentation does occasionally cast healing spells which are able to proc this effect."
    },
    "Arcane Mage": {
      "tier": "B-",
      "note": ""
    },
    "Fire Mage": {
      "tier": "A",
      "note": "Passive trinket."
    },
    "Frost Mage": {
      "tier": "C",
      "note": "This trinket focuses on single target damage."
    },
    "Mistweaver Monk": {
      "tier": "C",
      "note": "This trinket straddles the line at the top of C-Rank because of how powerful its damaging effect is in M+ content, especially when combined with  Lord Waycrest's Signet. The healing it restores by itself is fine."
    },
    "Holy Paladin": {
      "tier": "B-",
      "note": "This is a simple Intellect trinket with a proc that can either do a bit of damage or healing."
    },
    "Discipline Priest": {
      "tier": "C",
      "note": "Low value output trinket."
    },
    "Holy Priest": {
      "tier": "C",
      "note": "Low value output trinket."
    },
    "Shadow Priest": {
      "tier": "D",
      "note": "Another consistent damage proc but a lack of target scaling and low damage makes it the first truly poor trinket choice."
    },
    "Elemental Shaman": {
      "tier": "B",
      "note": "Even with the set bonus, this trinket would be too bad to see play. Lacking any benefit in AoE and losing out even in Single Target, there is not much reason to target this trinket."
    }
  },
  "Smoldering Seedling": {
    "Restoration Druid": {
      "tier": "B-",
      "note": "Smoldering Seedling spawns a little tree in front of you (you'll need a macro to easily target it). It'll take any single target heals you drop on it and radiate them to your raid, healing 5 people. It's incredibly difficult to play well, and while it does ok on paper it's unlikely to be something that's worth the trouble. We also take a little bit of time to set up our single target heals and Seedling only lasts for 12 seconds."
    },
    "Preservation Evoker": {
      "tier": "B-",
      "note": "Smoldering Seedling does acceptable healing on paper, but it's extremely difficult to use well. It'll spawn a little tree in front of you, that you'll need a macro to easily target, and then you have to spam single target heals into it (which we're not good at) in order to heal your group. During AoE damage, you're going to be better off just using your regular AoE spells rather than trying to set this up."
    },
    "Mistweaver Monk": {
      "tier": "B",
      "note": "Turning single target healing into mult-target healing is something we already do, so a trinket that plays into that for even more healing should be good for us, right? Having it be a primary target for any  Clouded Focus based healing would bring down that build's overhealing, but this trinket would only be active every other major ramp window. Plus, the benefit to keeping it alive is underwhelming for us, so there's no major incentive for us to keep it alive for the full duration. A nice cherry on top for this trinket."
    },
    "Holy Paladin": {
      "tier": "B",
      "note": "Functionally, this trinket is awful. It spawns a tiny treant that you have to manually target or have specific macros to heal. Numbers wise it can be decent but due to how it works I would never recommend using this personally."
    },
    "Discipline Priest": {
      "tier": "B",
      "note": "Lowly tuned output trinket and poor to use as Disc."
    },
    "Holy Priest": {
      "tier": "A",
      "note": "Decent output trinket that requires you to to spam heal a seed, keep it alive to later receive a stat buff."
    }
  },
  "Blossom of Amirdrassil": {
    "Restoration Druid": {
      "tier": "B-",
      "note": "Acceptable for normal and heroic content but the throughput just isn't there for a trinket without intellect on it. The delivery method isn't ideal either but that could be overlooked if the trinket was way stronger."
    },
    "Preservation Evoker": {
      "tier": "C+",
      "note": "Woefully undertuned for competitive content and the passive haste on it doesn't help us much either. An acceptable pick-up for normal and low heroic content."
    },
    "Mistweaver Monk": {
      "tier": "A-",
      "note": "This trinket gives us a flat amount of Haste, while also being the highest iLvL trinket accessible to us, thanks to it being a Very Rare drop from the end boss of the raid. So it's already strong in the stats-given department. Unfortunately, the effect automatically starts whenever you heal anyone below 80% health, meaning you don't really have much agency over this effect. You just...have to hope it's active when you can use its effect."
    },
    "Holy Paladin": {
      "tier": "B+",
      "note": "This is our \"very rare\" trinket this season. Its status as \"very rare\" is not really justified by its performance, which is \"decent\" at best."
    },
    "Discipline Priest": {
      "tier": "S",
      "note": "Passive output trinket with passive haste."
    },
    "Holy Priest": {
      "tier": "A",
      "note": "Solid passive output trinket."
    }
  },
  "Time-Thief's Gambit": {
    "Restoration Druid": {
      "tier": "B-",
      "note": "This is quite good for us in theory since we're able to leverage its 1 minute cooldown haste buff extremely well by combining it with  Flourish. The issue is a 5s stun later in the fight is unacceptable in modern WoW raids. You'll need to kill enemies in order to push the stun back until after the fight ends. Maybe something to play around with during farm or if there's a fight that enables it."
    },
    "Devastation Evoker": {
      "tier": "D",
      "note": "On-use that starts a timer before you are stunned. Kill mobs to extend timer."
    },
    "Preservation Evoker": {
      "tier": "D",
      "note": "A haste on-use trinket is already pretty bad for us, and the idea of it stunning us a few minutes later is even worse. Pass."
    },
    "Augmentation Evoker": {
      "tier": "C",
      "note": "Passive Intellect is always valuable as a baseline effect, but the on-use effect here is simply not worth attempting to play around."
    },
    "Arcane Mage": {
      "tier": "D",
      "note": "This is going to be very bad in most situations (I think)."
    },
    "Fire Mage": {
      "tier": "D",
      "note": "On-use that starts a timer before you are stunned. Kill mobs to extend timer."
    },
    "Frost Mage": {
      "tier": "D",
      "note": "Immunities and stun removals do not get rid of the stun, making the downside very problematic regardless of how much DPS the trinket provides."
    },
    "Mistweaver Monk": {
      "tier": "D",
      "note": "This trinket is not on our loot table, as it is intended for Intellect-based damage dealers, but if we can get this traded to us, it allows for frequent Haste buffs every minute, with a minor drawback in a 5 second stun later on during an encounter. Being able to time this with each  Invoke Yu'lon, the Jade Serpent ramp can greatly increase our healing. This trinket really shines where you're in an encounter that has frequent add deaths, as it pushes the drawback away, but even then, timing its uses so that you aren't stunned at bad times will be crucial to getting the most out of this trinket."
    },
    "Discipline Priest": {
      "tier": "D",
      "note": "Haste on use"
    },
    "Holy Priest": {
      "tier": "D",
      "note": "Haste on use that can possibly stun you. Very poor choice."
    },
    "Shadow Priest": {
      "tier": "C",
      "note": "This on use trinket has the potential to be powerful but can be difficult to use effectively. It is still however worse than the other on use trinkets listed above."
    },
    "Elemental Shaman": {
      "tier": "D",
      "note": "Even on fights where you can abuse this trinket, it is not expected to perform well. We already have sufficient haste in most cases, especially during AoE, so we are just more likely to reach haste cap. Getting stunned for 5 seconds is also too much of a penalty to consider running this in hard content."
    }
  },
  "Revitalizing Voodoo Totem": {
    "Restoration Druid": {
      "tier": "C+",
      "note": "We already have very strong answers for single target healing scenarios and this is likely to feel unnecessary. For what it's worth it does do a decent amount of healing to one target. We'd just rather have something that's more globally effective."
    },
    "Preservation Evoker": {
      "tier": "B-",
      "note": "This is quite good if you want a short single target heal. The problem it runs into is you're not often willing to sacrifice overall throughput for it - particularly given how long the cooldown on it is. Niche."
    },
    "Mistweaver Monk": {
      "tier": "B",
      "note": "The baseline amount of Intellect this trinket gives is nice, and the heal effect is on a short enough cooldown that you can get some good uses out of it without feeling like you need to save it."
    },
    "Holy Paladin": {
      "tier": "B",
      "note": "An on use trinket that provides a HoT effect to your target. This trinket is not spectacular but is good for healing a specific target."
    },
    "Discipline Priest": {
      "tier": "C",
      "note": "On use output trinket, poorly tuned."
    },
    "Holy Priest": {
      "tier": "C",
      "note": "On use output trinket, poorly tuned."
    }
  },
  "Vessel of Skittering Shadows": {
    "Devastation Evoker": {
      "tier": "A-",
      "note": "Passive. Deals damage when it procs."
    },
    "Augmentation Evoker": {
      "tier": "B",
      "note": "Passive Intellect and direct damage for solid value. The damaging effect procs roughly twice per minute (hasted) and has a modest travel time, but does scale slightly with additional targets."
    },
    "Arcane Mage": {
      "tier": "B",
      "note": "Decent single target option."
    },
    "Fire Mage": {
      "tier": "A",
      "note": "Passive damage."
    },
    "Frost Mage": {
      "tier": "B",
      "note": "This trinket focuses on single target damage."
    },
    "Shadow Priest": {
      "tier": "C",
      "note": "This is a reasonable passive single target trinket with some mild target scaling up to 5. Though Shadow greatly prefers passive trinkets that provide stats, this is the best raw damage option due to its consistency and ease of use."
    },
    "Elemental Shaman": {
      "tier": "A",
      "note": "Solid overall proc trinket, if you want another passive trinket, this is also a good choice."
    },
    "Affliction Warlock": {
      "tier": "A",
      "note": "Equip based trinket with a strong damage based effect. Also has minor AOE implications."
    },
    "Demonology Warlock": {
      "tier": "A-",
      "note": "A decent passive trinket; though lacking any secondary stat the damage the ooze does is still fairly good all things considered. Can be a good stop gap trinket to obtain early on in the season."
    }
  },
  "Neltharion's Call to Chaos": {
    "Devastation Evoker": {
      "tier": "B+",
      "note": "Season 2 Trinket, damage taken increased during buff."
    }
  },
  "Spoils of Neltharus": {
    "Devastation Evoker": {
      "tier": "C-",
      "note": "Season 2. Strong on-use trinket."
    }
  },
  "Corrupted Starlight": {
    "Devastation Evoker": {
      "tier": "D",
      "note": "Passive trinket. Deals damage over time in an area."
    },
    "Augmentation Evoker": {
      "tier": "C",
      "note": "Passive Mastery is not strictly ideal, and the proc rate on the damaging effect is only somewhat reliable at 1.25 procs per minute (hasted). The damage is dealt over time, requires that enemies stand still, and has been known to break crowd control. Not a top pick overall."
    },
    "Arcane Mage": {
      "tier": "F",
      "note": ""
    },
    "Fire Mage": {
      "tier": "B",
      "note": "Passive trinket."
    },
    "Frost Mage": {
      "tier": "C",
      "note": ""
    },
    "Protection Paladin": {
      "tier": "A",
      "note": "This is a random proc trinket that sims moderately well. It has passive Mastery which has some defensive value. A lot of the value is in the proc, happens ~1.25 times per minute. It can proc on any target you hit with your spells including  Avenger's Shield. The trinket spawns a dark red pool on the ground below your target and as long its in it, it does damage. In any encounter with movement or kiting, the trinket loses value. This trinket will shine in stand still situations with little movement.Note: This trinket has to be traded to you and you can't loot it from the Grat Vault."
    },
    "Shadow Priest": {
      "tier": "D",
      "note": "This trinket looks ok on paper but unfortunately the damage is dealt by a proc which places a small puddle on the ground that does not move. If the target is completely stationary this trinket is at best passable, but in most realistic scenarios will perform significantly worse. Again, avoid running Darkheart Thicket in Shadow or Discipline loot spec so as to never loot this trinket."
    },
    "Elemental Shaman": {
      "tier": "B",
      "note": "Having to rely on your tank to keep the mobs inside of the puddles spawned by this trinket is a big drawback. Potentially an okay pick up for Mythic+."
    },
    "Affliction Warlock": {
      "tier": "D",
      "note": "Trinket is AOE based only and does little damage."
    },
    "Destruction Warlock": {
      "tier": "D",
      "note": "Trinket is AOE based only and does little damage."
    }
  },
  "Idol of the Earth-Warder": {
    "Preservation Evoker": {
      "tier": "A",
      "note": "Idol of the Earthwarder is quite good, though by the time you're in best in slot gear you're likely to have enough mastery to push this quite far into diminishing returns. It's also difficult to spend one of your early crafts on a trinket."
    },
    "Assassination Rogue": {
      "tier": "D",
      "note": "In no way good, but it is the best we have out of the crafted trinkets"
    },
    "Subtlety Rogue": {
      "tier": "B",
      "note": "The best Crafted Trinket for us. The stacks you get depend on the amount of Neltharite and it is recommended to simulate gem combinations to get maximum value out of the trinket."
    },
    "Enhancement Shaman": {
      "tier": "B",
      "note": "Idols are the only crafted trinkets worth considering, with the advantage of being able to select the stat you want to boost. Its biggest downside is needing sockets on gear to support it, making it hard to rank higher especially when by the time you reach that point you've probably picked up something better."
    }
  },
  "Idol of the Earth-Warder /  Idol of the Life-Binder": {
    "Beast Mastery Hunter": {
      "tier": "B",
      "note": "This is similar to the haste one but most items in Raid or Mythic+ have more mastery or crit on them than haste, so the extra haste is generally more useful. Requires a  Spark of Dreams to make."
    }
  },
  "Darkmoon Decks": {
    "Beast Mastery Hunter": {
      "tier": "C",
      "note": "This is generally less impressive than other profession trinkets while also being more restrictive. Also requires a  Spark of Dreams to make."
    }
  },
  "Idol of the Spell-Weaver": {
    "Beast Mastery Hunter": {
      "tier": "D",
      "note": "This is imply worse than the other alternatives. Requires a  Spark of Dreams to make."
    },
    "Outlaw Rogue": {
      "tier": "C",
      "note": "A decent trinket but since it costs a  Spark of Dreams to make it's hard to justify."
    },
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    }
  },
  "Idol of the Dreamer and similar.": {
    "Marksmanship Hunter": {
      "tier": "C",
      "note": "Average Stat Proc Trinket. Proc type and strength depends on socket count, and type. Requires a  Spark of Dreams to make."
    }
  },
  "Alacritous Alchemist Stone and similar.": {
    "Marksmanship Hunter": {
      "tier": "D",
      "note": "Weak Stat Proc Trinket. Requires a  Spark of Dreams to make."
    }
  },
  "Verdant Gladiator's Badge of Ferocity": {
    "Arcane Mage": {
      "tier": "F",
      "note": ""
    }
  },
  "Vessel of Searing Shadow": {
    "Fire Mage": {
      "tier": "C-",
      "note": "Season 2. Passive trinket."
    }
  },
  "Beacon to the Beyond": {
    "Brewmaster Monk": {
      "tier": "A-",
      "note": "Powerful direct damage trinket. All it does is damage, but it does a lot. It will eventually be outclassed by higher item level options."
    },
    "Protection Paladin": {
      "tier": "A",
      "note": "A damage trinket with a cast time. It will do good damage in any situation with up to 5 targets. Damage is split so it will drop off after that. The trinket has passive mastery which gives it some defensive value. The trinket has a 2 second cast time so be aware of when you use it as you won't be able to block or parry during the cast. This is a trinket from the previous raid but it is affected by external damages on two encounters: Smolderon and Tindral Sageswift where they have burn phases. This trinket will help you maximize damage output in those phases."
    },
    "Protection Warrior": {
      "tier": "A-",
      "note": "Powerful direct damage trinket. All it does is damage, but it does a lot. It will eventually be outclassed by higher item level options."
    }
  },
  "Dragonfire Bomb Dispenser": {
    "Brewmaster Monk": {
      "tier": "A-",
      "note": "Direct damage trinket. It's simple, available often, and deals a pretty good amount of damage. Rushing Jade Wind triggers the Flash of Inspiration effect, so maintaining a steady supply of bombs is pretty easy. The only problems this trinket has are that its short cooldown makes it a small liability for any double on-use trinket setups (its on-use effect only triggers a 10-second cooldown instead of the usual 20), and the 7-second fuse is a fairly long delay for priority damage targets. It's extremely good, and should be a high priority, it can just be a little annoying to use at times. It will eventually be outclassed by higher item level trinkets."
    }
  },
  "Neltharion's Call to Dominance": {
    "Mistweaver Monk": {
      "tier": "B",
      "note": "While a season out of date and nerfed from its initial design, this trinket is still extremely strong for us, as the Intellect gained during our Celestial windows is always going to be effective. This trinket can stick around for a bit depending on your trinket luck, but it's not going to be equipped forever."
    }
  },
  "Screaming Black Dragonscale": {
    "Mistweaver Monk": {
      "tier": "D",
      "note": "While it doesn't give us Haste, the high uptime on the Critical Strike and Leech effect still makes it extremely desirable for Mistweavers. However, the change of seasons hasn't been kind to this in the long run of Season 3."
    }
  },
  "Idol of the Life-Binder": {
    "Holy Paladin": {
      "tier": "A-",
      "note": "Crafted through Jewelcrafting, this is a simple proc trinket. It's proc has decent uptime, and grant a good amount of secondaries, scaling with the amount of gems you have on your gear."
    },
    "Discipline Priest": {
      "tier": "A",
      "note": "Solid passive stat trinket, improved with more sockets"
    },
    "Holy Priest": {
      "tier": "A",
      "note": "Solid passive stat trinket, improved with more sockets"
    },
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    }
  },
  "Any Other Crafted Trinket (including all Darkmoon Decks and other Alchemist Stones)": {
    "Assassination Rogue": {
      "tier": "F",
      "note": "There are numerous other crafted trinkets available from crafting professions. They are all however not worth the very valuable  Nascent Aspect's Dreaming Crest and  Spark of Dreams crafting materials. Do not craft them"
    }
  },
  "Darkmoon Deck Box: Watcher": {
    "Subtlety Rogue": {
      "tier": "F",
      "note": ""
    }
  },
  "Elementium Pocket Anvil": {
    "Protection Warrior": {
      "tier": "A-",
      "note": "Single-target DPS trinket. It procs occasionally, for a decent amount of damage, but it is mainly useful for single-target. The on-use is pretty minor, but buffs the damage of all subsequent procs for the remainder of the encounter. Not great for AoE or Mythic+ situations, but really good in a lot of raid fights. It will be outclassed by higher item level options."
    }
  }
}